{
  "subject": "sds",
  "topic": "dsd",
  "title": "The Core of Truth: Dharma Sutradoha in Sadratnamana",
  "shloka": "Yama, Yama, ma yama, yama—sa ya raha, reya raha.",
  "translation": "Duty, Duty, duty and duty—correct virtue, wise virtue.",
  "explanation": "Dharma Sutradoha, or Dharma Sutradoha, is the central principle of Yama (duty) in Buddhism. It comprises two parts: Yama, which refers to duties one must perform, and Sutradoha, a correct virtue derived from Yama. This concept is deeply rooted in ancient Indian knowledge and aligns with the teachings of Sadratnamana. In the context of Sadratnamana (The Veda), understanding dsa helps individuals practice their duties effectively while maintaining inner peace. The pursuit of dsa contributes to personal growth and spiritual development, emphasizing both moral obligation and inner virtue. This concept has historical significance in shaping Buddhist practices and continues to resonate in modern teachings on personal and spiritual growth.",
  "activity": "Create a guidebook for students learning the principles of Dharma Sutradoha within the context of the Sadratnamana (Veda). The guidebook should include methods for practicing dsa, such as meditation or inner reflection, and provide exercises or scenarios to apply these principles. Include activities suitable for different skill levels, from beginner to advanced.",
  "question": "How does the concept of Dharma Sutradoha influence personal development in both traditional Buddhist practices and modern life? Discuss its role in balancing duties with inner virtue.",
  "wikipedia_info": {
    "title": "2018 Slovenian parliamentary election",
    "summary": "Parliamentary elections were held in Slovenia on 3 June 2018. The elections were originally expected to be held later in June 2018, but after the resignation of Prime Minister Miro Cerar on 14 March 2018 all parties called for snap elections. They were the third consecutive snap elections after 2011 and 2014.",
    "url": "https://en.wikipedia.org/wiki/2018_Slovenian_parliamentary_election",
    "related_articles": [
      "United Left (Slovenia)",
      "Halle (album)",
      "Down Upbeat",
      "Sun Sun"
    ]
  },
  "sources": [
    "Wikipedia",
    "Ollama (deepseek-r1:1.5b)"
  ],
  "wikipedia_summary": "Parliamentary elections were held in Slovenia on 3 June 2018. The elections were originally expected to be held later in June 2018, but after the resignation of Prime Minister Miro Cerar on 14 March 2018 all parties called for snap elections. They were the third consecutive snap elections after 2011 and 2014.",
  "metadata": {
    "timestamp": 1748329770.6435742,
    "date_created": "2025-05-27T12:39:30.643574",
    "version": "1.0"
  }
}