{
  "subject": "maths ",
  "topic": "trignometry",
  "wikipedia": {
    "title": "Trigonometry",
    "summary": "Trigonometry (from Ancient Greek  τρίγωνον (trígōnon) 'triangle' and  μέτρον (métron) 'measure') is a branch of mathematics concerned with relationships between angles and side lengths of triangles. In particular, the trigonometric functions relate the angles of a right triangle with ratios of its side lengths. The field emerged in the Hellenistic world during the 3rd century BC from applications of geometry to astronomical studies. The Greeks focused on the calculation of chords, while mathematicians in India created the earliest-known tables of values for trigonometric ratios (also called trigonometric functions) such as sine.\nThroughout history, trigonometry has been applied in areas such as geodesy, surveying, celestial mechanics, and navigation.\nTrigonometry is known for its many identities. These \ntrigonometric identities are commonly used for rewriting trigonometrical expressions with the aim to simplify an expression, to find a more useful form of an expression, or to solve an equation.",
    "content": "Trigonometry (from Ancient Greek  τρίγωνον (trígōnon) 'triangle' and  μέτρον (métron) 'measure') is a branch of mathematics concerned with relationships between angles and side lengths of triangles. In particular, the trigonometric functions relate the angles of a right triangle with ratios of its side lengths. The field emerged in the Hellenistic world during the 3rd century BC from applications of geometry to astronomical studies. The Greeks focused on the calculation of chords, while mathematicians in India created the earliest-known tables of values for trigonometric ratios (also called trigonometric functions) such as sine.\nThroughout history, trigonometry has been applied in areas such as geodesy, surveying, celestial mechanics, and navigation.\nTrigonometry is known for its many identities. These \ntrigonometric identities are commonly used for rewriting trigonometrical expressions with the aim to simplify an expression, to find a more useful form of an expression, or to solve an equation.\n\n\n== History ==\n\nSumerian astronomers studied angle measure, using a division of circles into 360 degrees. They, and later the Babylonians, studied the ratios of the sides of similar triangles and discovered some properties of these ratios but did not turn that into a systematic method for finding sides and angles of triangles. The ancient Nubians used a similar method.\nIn the 3rd century BC, Hellenistic mathematicians such as Euclid and Archimedes studied the properties of chords and inscribed angles in circles, and they proved theorems that are equivalent to modern trigonometric formulae, although they presented them geometrically rather than algebraically. In 140 BC, Hipparchus (from Nicaea, Asia Minor) gave the first tables of chords, analogous to modern tables of sine values, and used them to solve problems in trigonometry and spherical trigonometry. In the 2nd century AD, the Greco-Egyptian astronomer Ptolemy (from Alexandria, Egypt) constructed detailed trigonometric tables (Ptolemy's table of chords) in Book 1, chapter 11 of his Almagest. Ptolemy used chord length to define his trigonometric functions, a minor difference from the sine convention we use today. (The value we call sin(θ) can be found by looking up the chord length for twice the angle of interest (2θ) in Ptolemy's table, and then dividing that value by two.) Centuries passed before more detailed tables were produced, and Ptolemy's treatise remained in use for performing trigonometric calculations in astronomy throughout the next 1200 years in the medieval Byzantine, Islamic, and, later, Western European worlds.\nThe modern definition of the sine is first attested in the Surya Siddhanta, and its properties were further documented in the 5th century (AD) by Indian mathematician and astronomer Aryabhata. These Greek and Indian works were translated and expanded by medieval Islamic mathematicians. In 830 AD, Persian mathematician Habash al-Hasib al-Marwazi produced the first table of cotangents. By the 10th century AD, in the work of Persian mathematician Abū al-Wafā' al-Būzjānī, all six trigonometric functions were used. Abu al-Wafa had sine tables in 0.25° increments, to 8 decimal places of accuracy, and accurate tables of tangent values. He also made important innovations in spherical trigonometry The Persian polymath Nasir al-Din al-Tusi has been described as the creator of trigonometry as a mathematical discipline in its own right. He was the first to treat trigonometry as a mathematical discipline independent from astronomy, and he developed spherical trigonometry into its present form. He listed the six distinct cases of a right-angled triangle in spherical trigonometry, and in his On the Sector Figure, he stated the law of sines for plane and spherical triangles, discovered the law of tangents for spherical triangles, and provided proofs for both these laws. Knowledge of trigonometric functions and methods reached Western Europe via Latin translations of Ptolemy's Greek Almagest as well as the works of Persian and Arab astronomers such as Al Battani and Nasir al-Din al-Tusi. One of the earliest works on trigonometry by a northern European mathematician is De Triangulis by the 15th century German mathematician Regiomontanus, who was encouraged to write, and provided with a copy of the Almagest, by the Byzantine Greek scholar cardinal Basilios Bessarion with whom he lived for several years. At the same time, another translation of the Almagest from Greek into Latin was completed by the Cretan George of Trebizond. Trigonometry was still so little known in 16th-century northern Europe that Nicolaus Copernicus devoted two chapters of De revolutionibus orbium coelestium to explain its basic concepts.\nDriven by the demands of navigation and the growing need for accurate maps of large geographic areas, trigonometry grew into a major branch of mathematics. Bartholomaeus Pitiscus was the first to use the word, publishing his Trigonometria in 1595. Gemma Frisius described for the first time the method of triangulation still used today in surveying. It was Leonhard Euler who fully incorporated complex numbers into trigonometry. The works of the Scottish mathematicians James Gregory in the 17th century and Colin Maclaurin in the 18th century were influential in the development of trigonometric series. Also in the 18th century, Brook Taylor defined the general Taylor series.\n\n\n== Trigonometric ratios ==\n\nTrigonometric ratios are the ratios between edges of a right triangle. These ratios depend only on one acute angle of the right triangle, since any two right triangles with the same acute angle are similar. \nSo, these ratios define functions of this angle that are called trigonometric functions. Explicitly, they are defined below as functions of the known angle A, where a,  b and h refer to the lengths of the sides in the accompanying figure.\nIn the following definitions, the hypotenuse is the side opposite to the 90-degree angle in a right triangle; it is the longest side of the triangle and one of the two sides adjacent to angle A. The adjacent leg is the other side that is adjacent to angle A. The opposite side is the side that is opposite to angle A. The terms perpendicular and base are sometimes used for the opposite and adjacent sides respectively. See below under Mnemonics.\n\nSine (denoted sin), defined as the ratio of the side opposite the angle to the hypotenuse.\n\n  \n    \n      \n        sin\n        ⁡\n        A\n        =\n        \n          \n            \n              opposite\n            \n            \n              hypotenuse\n            \n          \n        \n        =\n        \n          \n            a\n            h\n          \n        \n        .\n      \n    \n    {\\displaystyle \\sin A={\\frac {\\textrm {opposite}}{\\textrm {hypotenuse}}}={\\frac {a}{h}}.}\n  \n\nCosine (denoted cos), defined as the ratio of the adjacent leg (the side of the triangle joining the angle to the right angle) to the hypotenuse.\n\n  \n    \n      \n        cos\n        ⁡\n        A\n        =\n        \n          \n            \n              adjacent\n            \n            \n              hypotenuse\n            \n          \n        \n        =\n        \n          \n            b\n            h\n          \n        \n        .\n      \n    \n    {\\displaystyle \\cos A={\\frac {\\textrm {adjacent}}{\\textrm {hypotenuse}}}={\\frac {b}{h}}.}\n  \n\nTangent (denoted tan), defined as the ratio of the opposite leg to the adjacent leg.\n\n  \n    \n      \n        tan\n        ⁡\n        A\n        =\n        \n          \n            \n              opposite\n            \n            \n              adjacent\n            \n          \n        \n        =\n        \n          \n            a\n            b\n          \n        \n        =\n        \n          \n            \n              a\n              \n                /\n              \n              h\n            \n            \n              b\n              \n                /\n              \n              h\n            \n          \n        \n        =\n        \n          \n            \n              sin\n              ⁡\n              A\n            \n            \n              cos\n              ⁡\n              A\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle \\tan A={\\frac {\\textrm {opposite}}{\\textrm {adjacent}}}={\\frac {a}{b}}={\\frac {a/h}{b/h}}={\\frac {\\sin A}{\\cos A}}.}\n  \n\nThe reciprocals of these ratios are named the cosecant (csc), secant (sec), and cotangent (cot), respectively:\n\n  \n    \n      \n        csc\n        ⁡\n        A\n        =\n        \n          \n            1\n            \n              sin\n              ⁡\n              A\n            \n          \n        \n        =\n        \n          \n            \n              hypotenuse\n            \n            \n              opposite\n            \n          \n        \n        =\n        \n          \n            h\n            a\n          \n        \n        ,\n      \n    \n    {\\displaystyle \\csc A={\\frac {1}{\\sin A}}={\\frac {\\textrm {hypotenuse}}{\\textrm {opposite}}}={\\frac {h}{a}},}\n  \n\n  \n    \n      \n        sec\n        ⁡\n        A\n        =\n        \n          \n            1\n            \n              cos\n              ⁡\n              A\n            \n          \n        \n        =\n        \n          \n            \n              hypotenuse\n            \n            \n              adjacent\n            \n          \n        \n        =\n        \n          \n            h\n            b\n          \n        \n        ,\n      \n    \n    {\\displaystyle \\sec A={\\frac {1}{\\cos A}}={\\frac {\\textrm {hypotenuse}}{\\textrm {adjacent}}}={\\frac {h}{b}},}\n  \n\n  \n    \n      \n        cot\n        ⁡\n        A\n        =\n        \n          \n            1\n            \n              tan\n              ⁡\n              A\n            \n          \n        \n        =\n        \n          \n            \n              adjacent\n            \n            \n              opposite\n            \n          \n        \n        =\n        \n          \n            \n              cos\n              ⁡\n              A\n            \n            \n              sin\n              ⁡\n              A\n            \n          \n        \n        =\n        \n          \n            b\n            a\n          \n        \n        .\n      \n    \n    {\\displaystyle \\cot A={\\frac {1}{\\tan A}}={\\frac {\\textrm {adjacent}}{\\textrm {opposite}}}={\\frac {\\cos A}{\\sin A}}={\\frac {b}{a}}.}\n  \n\nThe cosine, cotangent, and cosecant are so named because they are respectively the sine, tangent, and secant of the complementary angle abbreviated to \"co-\".\nWith these functions, one can answer virtually all questions about arbitrary triangles by using the law of sines and the law of cosines. These laws can be used to compute the remaining angles and sides of any triangle as soon as two sides and their included angle or two angles and a side or three sides are known.\n\n\n=== Mnemonics ===\n\nA common use of mnemonics is to remember facts and relationships in trigonometry. For example, the sine, cosine, and tangent ratios in a right triangle can be remembered by representing them and their corresponding sides as strings of letters. For instance, a mnemonic is SOH-CAH-TOA:\n\nSine = Opposite ÷ Hypotenuse\nCosine = Adjacent ÷ Hypotenuse\nTangent = Opposite ÷ Adjacent\nOne way to remember the letters is to sound them out phonetically (i.e.  SOH-kə-TOH-ə, similar to Krakatoa). Another method is to expand the letters into a sentence, such as \"Some Old Hippie Caught Another Hippie Trippin' On Acid\".\n\n\n=== The unit circle and common trigonometric values ===\n\nTrigonometric ratios can also be represented using the unit circle, which is the circle of radius 1 centered at the origin in the plane. In this setting, the terminal side of an angle A placed in standard position will intersect the unit circle in a point (x,y), where \n  \n    \n      \n        x\n        =\n        cos\n        ⁡\n        A\n      \n    \n    {\\displaystyle x=\\cos A}\n  \n and \n  \n    \n      \n        y\n        =\n        sin\n        ⁡\n        A\n      \n    \n    {\\displaystyle y=\\sin A}\n  \n. This representation allows for the calculation of commonly found trigonometric values, such as those in the following table:\n\n\n== Trigonometric functions of real or complex variables ==\n\nUsing the unit circle, one can extend the definitions of trigonometric ratios to all positive and negative arguments (see trigonometric function).\n\n\n=== Graphs of trigonometric functions ===\nThe following table summarizes the properties of the graphs of the six main trigonometric functions:\n\n\n=== Inverse trigonometric functions ===\n\nBecause the six main trigonometric functions are periodic, they are not injective (or, 1 to 1), and thus are not invertible. By restricting the domain of a trigonometric function, however, they can be made invertible.: 48ff \nThe names of the inverse trigonometric functions, together with their domains and range, can be found in the following table:: 48ff : 521ff \n\n\n=== Power series representations ===\nWhen considered as functions of a real variable, the trigonometric ratios can be represented by an infinite series. For instance, sine and cosine have the following representations:\n\n  \n    \n      \n        \n          \n            \n              \n                sin\n                ⁡\n                x\n              \n              \n                \n                =\n                x\n                −\n                \n                  \n                    \n                      x\n                      \n                        3\n                      \n                    \n                    \n                      3\n                      !\n                    \n                  \n                \n                +\n                \n                  \n                    \n                      x\n                      \n                        5\n                      \n                    \n                    \n                      5\n                      !\n                    \n                  \n                \n                −\n                \n                  \n                    \n                      x\n                      \n                        7\n                      \n                    \n                    \n                      7\n                      !\n                    \n                  \n                \n                +\n                ⋯\n              \n            \n            \n              \n              \n                \n                =\n                \n                  ∑\n                  \n                    n\n                    =\n                    0\n                  \n                  \n                    ∞\n                  \n                \n                \n                  \n                    \n                      (\n                      −\n                      1\n                      \n                        )\n                        \n                          n\n                        \n                      \n                      \n                        x\n                        \n                          2\n                          n\n                          +\n                          1\n                        \n                      \n                    \n                    \n                      (\n                      2\n                      n\n                      +\n                      1\n                      )\n                      !\n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\sin x&=x-{\\frac {x^{3}}{3!}}+{\\frac {x^{5}}{5!}}-{\\frac {x^{7}}{7!}}+\\cdots \\\\&=\\sum _{n=0}^{\\infty }{\\frac {(-1)^{n}x^{2n+1}}{(2n+1)!}}\\\\\\end{aligned}}}\n  \n\n  \n    \n      \n        \n          \n            \n              \n                cos\n                ⁡\n                x\n              \n              \n                \n                =\n                1\n                −\n                \n                  \n                    \n                      x\n                      \n                        2\n                      \n                    \n                    \n                      2\n                      !\n                    \n                  \n                \n                +\n                \n                  \n                    \n                      x\n                      \n                        4\n                      \n                    \n                    \n                      4\n                      !\n                    \n                  \n                \n                −\n                \n                  \n                    \n                      x\n                      \n                        6\n                      \n                    \n                    \n                      6\n                      !\n                    \n                  \n                \n                +\n                ⋯\n              \n            \n            \n              \n              \n                \n                =\n                \n                  ∑\n                  \n                    n\n                    =\n                    0\n                  \n                  \n                    ∞\n                  \n                \n                \n                  \n                    \n                      (\n                      −\n                      1\n                      \n                        )\n                        \n                          n\n                        \n                      \n                      \n                        x\n                        \n                          2\n                          n\n                        \n                      \n                    \n                    \n                      (\n                      2\n                      n\n                      )\n                      !\n                    \n                  \n                \n                .\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}\\cos x&=1-{\\frac {x^{2}}{2!}}+{\\frac {x^{4}}{4!}}-{\\frac {x^{6}}{6!}}+\\cdots \\\\&=\\sum _{n=0}^{\\infty }{\\frac {(-1)^{n}x^{2n}}{(2n)!}}.\\end{aligned}}}\n  \n\nWith these definitions the trigonometric functions can be defined for complex numbers. When extended as functions of real or complex variables, the following formula holds for the complex exponential:\n\n  \n    \n      \n        \n          e\n          \n            x\n            +\n            i\n            y\n          \n        \n        =\n        \n          e\n          \n            x\n          \n        \n        (\n        cos\n        ⁡\n        y\n        +\n        i\n        sin\n        ⁡\n        y\n        )\n        .\n      \n    \n    {\\displaystyle e^{x+iy}=e^{x}(\\cos y+i\\sin y).}\n  \n\nThis complex exponential function, written in terms of trigonometric functions, is particularly useful.\n\n\n=== Calculating trigonometric functions ===\n\nTrigonometric functions were among the earliest uses for mathematical tables. Such tables were incorporated into mathematics textbooks and students were taught to look up values and how to interpolate between the values listed to get higher accuracy. Slide rules had special scales for trigonometric functions.\nScientific calculators have buttons for calculating the main trigonometric functions (sin, cos, tan, and sometimes cis and their inverses). Most allow a choice of angle measurement methods: degrees, radians, and sometimes gradians. Most computer programming languages provide function libraries that include the trigonometric functions. The floating point unit hardware incorporated into the microprocessor chips used in most personal computers has built-in instructions for calculating trigonometric functions.\n\n\n=== Other trigonometric functions ===\n\nIn addition to the six ratios listed earlier, there are additional trigonometric functions that were historically important, though seldom used today. These include the chord (crd(θ) = 2 sin(⁠θ/2⁠)), the versine (versin(θ) = 1 − cos(θ) = 2 sin2(⁠θ/2⁠)) (which appeared in the earliest tables), the coversine (coversin(θ) = 1 − sin(θ) = versin(⁠π/2⁠ − θ)), the haversine (haversin(θ) = ⁠1/2⁠versin(θ) = sin2(⁠θ/2⁠)), the exsecant (exsec(θ) = sec(θ) − 1), and the excosecant (excsc(θ) = exsec(⁠π/2⁠ − θ) = csc(θ) − 1). See List of trigonometric identities for more relations between these functions.\n\n\n== Applications ==\n\n\n=== Astronomy ===\n\nFor centuries, spherical trigonometry has been used for locating solar, lunar, and stellar positions, predicting eclipses, and describing the orbits of the planets.\nIn modern times, the technique of triangulation is used in astronomy to measure the distance to nearby stars, as well as in satellite navigation systems.\n\n\n=== Navigation ===\n\nHistorically, trigonometry has been used for locating latitudes and longitudes of sailing vessels, plotting courses, and calculating distances during navigation.\nTrigonometry is still used in navigation through such means as the Global Positioning System and artificial intelligence for autonomous vehicles.\n\n\n=== Surveying ===\n\nIn land surveying, trigonometry is used in the calculation of lengths, areas, and relative angles between objects.\nOn a larger scale, trigonometry is used in geography to measure distances between landmarks.\n\n\n=== Periodic functions ===\n\nThe sine and cosine functions are fundamental to the theory of periodic functions, such as those that describe sound and light waves. Fourier discovered that every continuous, periodic function could be described as an infinite sum of trigonometric functions.\nEven non-periodic functions can be represented as an integral of sines and cosines through the Fourier transform. This has applications to quantum mechanics and communications, among other fields.\n\n\n=== Optics and acoustics ===\n\nTrigonometry is useful in many physical sciences, including acoustics, and optics. In these areas, they are used to describe sound and light waves, and to solve boundary- and transmission-related problems.\n\n\n=== Other applications ===\nOther fields that use trigonometry or trigonometric functions include music theory, geodesy, audio synthesis, architecture, electronics, biology, medical imaging (CT scans and ultrasound), chemistry, number theory (and hence cryptology), seismology, meteorology, oceanography, image compression, phonetics, economics, electrical engineering, mechanical engineering, civil engineering, computer graphics, cartography, crystallography and game development.\n\n\n== Identities ==\n\nTrigonometry has been noted for its many identities, that is, equations that are true for all possible inputs.\nIdentities involving only angles are known as trigonometric identities. Other equations, known as triangle identities, relate both the sides and angles of a given triangle.\n\n\n=== Triangle identities ===\n\nIn the following identities, A, B and C are the angles of a triangle and a, b and c are the lengths of sides of the triangle opposite the respective angles (as shown in the diagram).\n\n\n==== Law of sines ====\nThe law of sines (also known as the \"sine rule\") for an arbitrary triangle states:\n\n  \n    \n      \n        \n          \n            a\n            \n              sin\n              ⁡\n              A\n            \n          \n        \n        =\n        \n          \n            b\n            \n              sin\n              ⁡\n              B\n            \n          \n        \n        =\n        \n          \n            c\n            \n              sin\n              ⁡\n              C\n            \n          \n        \n        =\n        2\n        R\n        =\n        \n          \n            \n              a\n              b\n              c\n            \n            \n              2\n              Δ\n            \n          \n        \n        ,\n      \n    \n    {\\displaystyle {\\frac {a}{\\sin A}}={\\frac {b}{\\sin B}}={\\frac {c}{\\sin C}}=2R={\\frac {abc}{2\\Delta }},}\n  \n\nwhere \n  \n    \n      \n        Δ\n      \n    \n    {\\displaystyle \\Delta }\n  \n is the area of the triangle and R is the radius of the circumscribed circle of the triangle:\n\n  \n    \n      \n        R\n        =\n        \n          \n            \n              a\n              b\n              c\n            \n            \n              (\n              a\n              +\n              b\n              +\n              c\n              )\n              (\n              a\n              −\n              b\n              +\n              c\n              )\n              (\n              a\n              +\n              b\n              −\n              c\n              )\n              (\n              b\n              +\n              c\n              −\n              a\n              )\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle R={\\frac {abc}{\\sqrt {(a+b+c)(a-b+c)(a+b-c)(b+c-a)}}}.}\n  \n\n\n==== Law of cosines ====\nThe law of cosines (known as the cosine formula, or the \"cos rule\") is an extension of the Pythagorean theorem to arbitrary triangles:\n\n  \n    \n      \n        \n          c\n          \n            2\n          \n        \n        =\n        \n          a\n          \n            2\n          \n        \n        +\n        \n          b\n          \n            2\n          \n        \n        −\n        2\n        a\n        b\n        cos\n        ⁡\n        C\n        ,\n      \n    \n    {\\displaystyle c^{2}=a^{2}+b^{2}-2ab\\cos C,}\n  \n\nor equivalently:\n\n  \n    \n      \n        cos\n        ⁡\n        C\n        =\n        \n          \n            \n              \n                a\n                \n                  2\n                \n              \n              +\n              \n                b\n                \n                  2\n                \n              \n              −\n              \n                c\n                \n                  2\n                \n              \n            \n            \n              2\n              a\n              b\n            \n          \n        \n        .\n      \n    \n    {\\displaystyle \\cos C={\\frac {a^{2}+b^{2}-c^{2}}{2ab}}.}\n  \n\n\n==== Law of tangents ====\nThe law of tangents, developed by François Viète, is an alternative to the Law of Cosines when solving for the unknown edges of a triangle, providing simpler computations when using trigonometric tables. It is given by:\n\n  \n    \n      \n        \n          \n            \n              a\n              −\n              b\n            \n            \n              a\n              +\n              b\n            \n          \n        \n        =\n        \n          \n            \n              tan\n              ⁡\n              \n                [\n                \n                  \n                    \n                      \n                        1\n                        2\n                      \n                    \n                  \n                  (\n                  A\n                  −\n                  B\n                  )\n                \n                ]\n              \n            \n            \n              tan\n              ⁡\n              \n                [\n                \n                  \n                    \n                      \n                        1\n                        2\n                      \n                    \n                  \n                  (\n                  A\n                  +\n                  B\n                  )\n                \n                ]\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\frac {a-b}{a+b}}={\\frac {\\tan \\left[{\\tfrac {1}{2}}(A-B)\\right]}{\\tan \\left[{\\tfrac {1}{2}}(A+B)\\right]}}}\n  \n\n\n==== Area ====\nGiven two sides a and b and the angle between the sides C, the area of the triangle is given by half the product of the lengths of two sides and the sine of the angle between the two sides:\n\n  \n    \n      \n        \n          \n            Area\n          \n        \n        =\n        Δ\n        =\n        \n          \n            1\n            2\n          \n        \n        a\n        b\n        sin\n        ⁡\n        C\n      \n    \n    {\\displaystyle {\\mbox{Area}}=\\Delta ={\\frac {1}{2}}ab\\sin C}\n  \n\n\n=== Trigonometric identities ===\n\n\n==== Pythagorean identities ====\nThe following trigonometric identities are related to the Pythagorean theorem and hold for any value:\n\n  \n    \n      \n        \n          sin\n          \n            2\n          \n        \n        ⁡\n        A\n        +\n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        A\n        =\n        1\n         \n      \n    \n    {\\displaystyle \\sin ^{2}A+\\cos ^{2}A=1\\ }\n  \n\n  \n    \n      \n        \n          tan\n          \n            2\n          \n        \n        ⁡\n        A\n        +\n        1\n        =\n        \n          sec\n          \n            2\n          \n        \n        ⁡\n        A\n         \n      \n    \n    {\\displaystyle \\tan ^{2}A+1=\\sec ^{2}A\\ }\n  \n\n  \n    \n      \n        \n          cot\n          \n            2\n          \n        \n        ⁡\n        A\n        +\n        1\n        =\n        \n          csc\n          \n            2\n          \n        \n        ⁡\n        A\n         \n      \n    \n    {\\displaystyle \\cot ^{2}A+1=\\csc ^{2}A\\ }\n  \n\nThe second and third equations are derived from dividing the first equation by \n  \n    \n      \n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        \n          A\n        \n      \n    \n    {\\displaystyle \\cos ^{2}{A}}\n  \n and \n  \n    \n      \n        \n          sin\n          \n            2\n          \n        \n        ⁡\n        \n          A\n        \n      \n    \n    {\\displaystyle \\sin ^{2}{A}}\n  \n, respectively.\n\n\n==== Euler's formula ====\nEuler's formula, which states that \n  \n    \n      \n        \n          e\n          \n            i\n            x\n          \n        \n        =\n        cos\n        ⁡\n        x\n        +\n        i\n        sin\n        ⁡\n        x\n      \n    \n    {\\displaystyle e^{ix}=\\cos x+i\\sin x}\n  \n, produces the following analytical identities for sine, cosine, and tangent in terms of e and the imaginary unit i:\n\n  \n    \n      \n        sin\n        ⁡\n        x\n        =\n        \n          \n            \n              \n                e\n                \n                  i\n                  x\n                \n              \n              −\n              \n                e\n                \n                  −\n                  i\n                  x\n                \n              \n            \n            \n              2\n              i\n            \n          \n        \n        ,\n        \n        cos\n        ⁡\n        x\n        =\n        \n          \n            \n              \n                e\n                \n                  i\n                  x\n                \n              \n              +\n              \n                e\n                \n                  −\n                  i\n                  x\n                \n              \n            \n            2\n          \n        \n        ,\n        \n        tan\n        ⁡\n        x\n        =\n        \n          \n            \n              i\n              (\n              \n                e\n                \n                  −\n                  i\n                  x\n                \n              \n              −\n              \n                e\n                \n                  i\n                  x\n                \n              \n              )\n            \n            \n              \n                e\n                \n                  i\n                  x\n                \n              \n              +\n              \n                e\n                \n                  −\n                  i\n                  x\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle \\sin x={\\frac {e^{ix}-e^{-ix}}{2i}},\\qquad \\cos x={\\frac {e^{ix}+e^{-ix}}{2}},\\qquad \\tan x={\\frac {i(e^{-ix}-e^{ix})}{e^{ix}+e^{-ix}}}.}\n  \n\n\n==== Other trigonometric identities ====\n\nOther commonly used trigonometric identities include the half-angle identities, the angle sum and difference identities, and the product-to-sum identities.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Bibliography ==\nBoyer, Carl B. (1991). A History of Mathematics (Second ed.). John Wiley & Sons, Inc. ISBN 978-0-471-54397-8.\nNielsen, Kaj L. (1966). Logarithmic and Trigonometric Tables to Five Places (2nd ed.). New York: Barnes & Noble. LCCN 61-9103.\nThurston, Hugh (1996). Early Astronomy. Springer Science & Business Media. ISBN 978-0-387-94822-5.\n\n\n== Further reading ==\n\"Trigonometric functions\". Encyclopedia of Mathematics. EMS Press. 2001 [1994].\nLinton, Christopher M. (2004). From Eudoxus to Einstein: A History of Mathematical Astronomy. Cambridge University Press.\nWeisstein, Eric W. \"Trigonometric Addition Formulas\". MathWorld.\n\n\n== External links ==\n\nKhan Academy: Trigonometry, free online micro lectures\nTrigonometry by Alfred Monroe Kenyon and Louis Ingold, The Macmillan Company, 1914. In images, full text presented.\nBenjamin Banneker's Trigonometry Puzzle at Convergence\nDave's Short Course in Trigonometry by David Joyce of Clark University\nTrigonometry, by Michael Corral, Covers elementary trigonometry, Distributed under GNU Free Documentation License",
    "url": "https://en.wikipedia.org/wiki/Trigonometry",
    "related_articles": [
      "Math library",
      "History of science"
    ]
  },
  "timestamp": 1748322776.641307
}