{
  "subject": "ved",
  "topic": "arthashastra",
  "wikipedia": {
    "title": "Vyasa",
    "summary": "Vyasa (; Sanskrit: व्यास, lit. 'compiler, arranger', IAST: Vyāsa) or Veda Vyasa (Sanskrit: वेदव्यास, lit. 'the one who classified the Vedas', IAST: Vedavyāsa), also known as Krishna Dvaipayana Veda Vyasa (Sanskrit: कृष्णद्वैपायन, IAST: Kṛṣṇadvaipāyana Vedavyāsa), is a rishi (sage) with a prominent role in most Hindu traditions. He is traditionally regarded as the author of the epic Mahābhārata, where he also plays a prominent role as a character. He is also regarded by the Hindu traditions to be the compiler of the mantras of the Vedas into four texts, as well as the author of the eighteen Purāṇas and the Brahma Sutras.\nVyasa is regarded by many Hindus as a partial incarnation (Sanskrit: अंशावतार, IAST: Aṃśāvatāra) of Vishnu. He is one of the immortals called the Chiranjivis, held by adherents to still be alive in the current age known as the Kali Yuga.",
    "content": "Vyasa (; Sanskrit: व्यास, lit. 'compiler, arranger', IAST: Vyāsa) or Veda Vyasa (Sanskrit: वेदव्यास, lit. 'the one who classified the Vedas', IAST: Vedavyāsa), also known as Krishna Dvaipayana Veda Vyasa (Sanskrit: कृष्णद्वैपायन, IAST: Kṛṣṇadvaipāyana Vedavyāsa), is a rishi (sage) with a prominent role in most Hindu traditions. He is traditionally regarded as the author of the epic Mahābhārata, where he also plays a prominent role as a character. He is also regarded by the Hindu traditions to be the compiler of the mantras of the Vedas into four texts, as well as the author of the eighteen Purāṇas and the Brahma Sutras.\nVyasa is regarded by many Hindus as a partial incarnation (Sanskrit: अंशावतार, IAST: Aṃśāvatāra) of Vishnu. He is one of the immortals called the Chiranjivis, held by adherents to still be alive in the current age known as the Kali Yuga.\n\n\n== Name ==\n\"Vyasa\" (Vyāsa) means \"compiler\" or \"arranger and also \"separation\" or \"division.\" Other meanings include \"split,\" \"differentiate,\" or \"describe.\" It is also a title, given to \"a holy sage or a pious learned man,\" and is applied to \"persons distinguished for their writings.\"\nVyasa is commonly known as \"Veda Vyasa\" (Sanskrit: वेदव्यास, Vedavyāsa) as he divided the single, eternal Veda into four separate books—Rigveda, Samaveda, Yajurveda and Atharvaveda. In the Mahabharata, Vyasa is also called Krishna, which refers to his dark complexion (krishna), and as Dvaipāyana, as his birthplace was on an island (dvaipayana), He is also referred to as Vaishampayan (Sanskrit: वैशम्पायन, Vaiṣampāyana).\n\n\n== Divider of the Veda ==\nHindus traditionally hold that Vyasa subcategorized the primordial single Veda to produce four parts as a canonical collection. Hence he was called Veda-Vyasa, or \"Splitter of the Vedas\", the splitting being a feat that allowed people to understand the divine knowledge of the Veda.\nThe Vishnu Puraṇa elaborates on the role of Vyasa in the Hindu chronology. The Hindu view of the universe is that of a cyclic phenomenon that comes into existence and dissolves repeatedly. Each kalpa cycle is presided over by a number of Manus, one for each manvantara, and each manvantara has a number of yuga cycles, each with four yuga ages of declining virtues. The Dvapara Yuga is the third yuga. The Vishṇu Puraṇa (Book 3, Ch 3) says:\n\nIn every third world age (Dvāpara), Vishnu, in the person of Vyāsa, in order to promote the good of mankind, divides the Veda, which is properly but one, into many portions. Observing the limited perseverance, energy and application of mortals, he makes the Veda fourfold, to adapt it to their capacities; and the bodily form which he assumes, in order to effect that classification, is known by the name of Vedavyāsa. Of the different Vyāsas in the present Manvantara and the branches which they have taught, you shall have an account.\nTwenty-eight times have the Vedas been arranged by the great Rishis in the Vaivasvata Manvantara [...] and consequently, eight and twenty Vyāsa's have passed away; by whom, in the respective periods, the Veda has been divided into four. The first... distribution was made by Svayambhū (Brahmā) himself; in the second, the arranger of the Veda (Vyasa) was Prajāpati [...] (and so on up to twenty-eight).\nAccording to the Vishṇu Purāṇa, Aśwatthāmā, the son of Droṇa, will become the next sage (Vyāsa) and will divide the Veda in 29th Mahā Yuga of 7th Manvantara.\n\n\n== Attributed texts ==\n\n\n=== The Mahabharata ===\n\nVyāsa is regarded as the author of the Mahabharata, a major epic of Hindu literature. The first section of the Mahābhārata states that Gaṇesha wrote the text to Vyasa's dictation, but this is regarded by scholars as a later interpolation to the epic and this part of the story is also excluded in the \"Critical Edition\" of the Mahābhārata.\nThe five Paṇḍava brothers of the junior line of the Kuru royal house being the ultimate victors, thus India's cultural heroes, Vyāsa's relationship with the winners in this kinship war of cousin against cousin is as chronicler who sired the father of the victors. These five protagonists are the surrogate sons of Pānḍu, sired by various gods on behalf of this Kuru king whom Vyāsa himself fathered 'under Niyoga practice' in place of an elder brother who died heirless, at the behest of his mother Satyavati. Vyāsa also sired the father of the vanquished, he was certainly the surgeon who put the hundred brothers of antagonist cousins into incubation, and as they are only said to be sired by a boon he conferred on their mother, there's some possibility that he is also their biological sire himself. Hence Vyāsa's authorship of the Mahābhārata is by way of biography of his own family including its adoptees. This was the struggle between his own ex officio grandsons. And it is in the wake of producing this purportedly historical, smriti Mahābhārata as well as 'compiling' the essential sruti scripture of the Vedas that 'Vyāsa' was added as epithet then eclipsed his two birth names, Krishṇa and Dvaipāyana, while his smiriti creation became a canon whose territorial name, drawing on either one or two legendary ruler's personal names, included in the saga's text, still underlies modern Sanskrit-to-Hindi official form, Bhārata Gaṇarājya, in the names for India through its current constitution.\nVyāsa's Jaya (literally, \"victory\"), the core of the Mahābhārata, is a dialogue between Dhritarāshtra (the Kuru king and the father of the Kauravas, who opposed the Pāṇḍavas in the Kurukshetra War) and Sanjaya, his adviser and charioteer. Sanjaya narrates the particulars of the Kurukshetra War, fought in eighteen days, chronologically. Dhritarashtra at times asks questions and expresses doubts, sometimes lamenting, fearing the destruction the war would bring on his family, friends and kin.\nThe Bhagavad Gita is contained in the Bhishma Parva, which comprises chapters 23-40 of book 6 of the Mahābhārata. The Gita, dated to the second half of the first millennium BCE, in its own right is one of the most influential philosophico-religious dialogues, producing numerous commentaries and a global audience. Like the \"Jaya\", it is also a dialogue, in which Paṇḍava Prince Arjuna's hesitation to attack his cousins is counseled from 'the perspective of the gods' by his charioteer, revealed to be an avatar of Vishnu. In 1981, Larson stated that \"a complete listing of Gita translations and a related secondary bibliography would be nearly endless\". The Bhagavad Gita has been highly praised, not only by prominent Indians including Mahatma Gandhi and Sarvepalli Radhakrishnan, but also by Aldous Huxley, Henry David Thoreau, J. Robert Oppenheimer, Ralph Waldo Emerson, Carl Jung, Hermann Hesse, and Bülent Ecevit.\n\n\n=== Puranas ===\n\nVyasa is also credited with the writing of the eighteen major Purāṇas, which are works of Indian literature that cover an encyclopedic range of topics covering various scriptures.\n\n\n=== Brahma Sutras ===\n\nThe Brahma Sutras, one of the foundational texts of Vedanta, is written by Bādarāyaṇa also called Veda Vyasa, \"one who arranges\".\n\n\n== Role in the Mahabharata ==\n\n\n=== Birth ===\n\nAccording to the Mahabharata, Vyasa's mother, Satyavati, was raised as the daughter of a fisherman, belonging to a clan that used to ferry people across the river Yamuna. She used to help her father in this task. It was during one such ferrying that she encountered the sage Parasara. As he boarded her boat, he was captivated by her beauty. Overcome with desire, he approached her, but she, recognizing his intent, humbly pleaded to preserve her chastity. However, Parasara used his divine powers to create an artificial fog around the boat and transformed her natural scent into the fragrance of musk. He also conjured an island in the middle of the river, where he consummated his union with her. After this, he assured her that she would remain a virgin despite giving birth. He prophesied that the son born to her would be an extraordinary being—a partial incarnation of Vishnu, a man of immense wisdom, and a revered teacher who would divide the Vedas and be honored across the three worlds.  \nFollowing this, Parasara performed his ablutions in the Yamuna and departed. Satyavati’s pregnancy was completed instantly, and she gave birth to a radiant and handsome boy on the island. As soon as he was born, the child matured into an ascetic form, exuding spiritual radiance. He reassured his mother that she need not worry about him and that he was leaving to undertake penance. He further promised that whenever she faced difficulties, she only needed to think of him, and he would appear by her side. Having said this, he departed, embarking on the path of a hermit. He was named Krishna Dvaipayana, referring to his dark complexion. \nSatyavati kept this incident a secret, not telling even King Shantanu whom she was married to later.\n\n\n=== Continuing the Kuru Dynasty ===\nShantanu and Satyavati had two sons, named Chitrāngada and Vichitravirya. Both of them died early without leaving an heir, but Vichitravirya had two wives – Ambika and Ambalika. A widowed Satyavati initially asked her stepson, Bhishma, to marry both the queens, but he refused, citing his vow of celibacy. Satyavati revealed her secret past and requested him to bring her firstborn to impregnate the widows under a tradition called Niyoga. \nSage Vyasa was unkempt because of months of meditation in the forest. Hence upon seeing him, Ambika who was rather scared shut her eyes, resulting in their child, Dhritarāshtra, being born blind. The other queen, Ambalika, turned pale upon meeting Vyasa, which resulted in their child, Pandu, being born pale. Alarmed, Satyavati requested that Vyasa meet Ambika again and grant her another son. Ambika instead sent her maid to meet Vyasa. The duty-bound maid was calm and composed; she had a healthy child who was later named Vidura.\nWhen the children of Vichitravirya grew up, Bhishma got them married to different women. Dhritarāshtra was married to Gāndhāri, princess of Gandhara. Pandu married Kunti and Madri. Pāṇḍu left the kingdom, leaving Dhritarashtra as the acting king. Gāndhāri, during her adolescence, received a boon to have a hundred children but her pregnancy was taking a long period of time. After two years of pregnancy, Gandhari aborted her developing fetus, giving birth to a hard mass that looked like an iron ball. Vyasa came to the kingdom and using his knowledge, he asked to divide the mass into one hundred and one pieces and put them into pots for incubation. After a year, 101 babies were born. Meanwhile, Pāṇḍu's wives, Kunti and Mādri, had three and two sons respectively.\nAfter the death of Pandu, he consoled Kunti and the young Pandavas, providing them with counsel in their time of bereavement. Vyāsa, feeling sorrow for his mother's fate, asked her to leave the kingdom and come with him to live a peaceful life. Satyavati, along with her two daughters-in-law, went to the forest.\n\n\n=== Influence on the political affairs of the Kuru Kingdom ===\nVyasa stands as a pivotal figure in the Mahabharata, serving as the spiritual and moral guide for both the Kauravas and the Pandavas. While his primary residence remained his hermitage, his influence extended deeply into the affairs of Hastinapura (capital of Kuru Kingdom). He was actively engaged in shaping events, offering counsel and intervention at crucial moments. \nHis influence extended to the broader political and social developments of the time. He played a decisive role in facilitating Draupadi’s marriage to the five Pandavas, thereby shaping an alliance that had significant implications in the unfolding events. His wisdom was frequently sought in matters of governance, and he was a regular presence in Yudhishthira’s court. Under his guidance, the Pandavas undertook regional conquests, expanding their influence. Vyasa also played a central role in the Rajasuya sacrifice performed by Yudhishthira, overseeing its arrangements and predicting the future course of events. Upon the conclusion of the ceremony, he performed the anointment of Yudhishthira.  \nAs hostilities between the Kauravas and the Pandavas escalated, Vyasa made multiple attempts to prevent conflict. He advised Dhritarashtra to restrain Duryodhana from unjust actions, warning of the potential consequences. During the Pandavas’ exile, he visited them in the forest and imparted teachings to Yudhishthira on various philosophical and strategic matters. Prior to the Kurukshetra war, he granted Sanjaya divine vision, enabling him to narrate the battle’s progress to Dhritarashtra. During the war, he provided guidance and consolation to Yudhishthira and Arjuna, both of whom were deeply affected by the destruction around them.  \nFollowing the war, Vyasa continued to be actively involved in the political and moral reconstruction of the kingdom. He intervened to prevent Gandhari from cursing the Pandavas in her grief and provided counsel to Yudhishthira on governance and statecraft. When Yudhishthira, overwhelmed by remorse, considered renouncing his throne, Vyasa dissuaded him, urging him to fulfill his responsibilities. He played a crucial role in post-war reconciliation, using his spiritual power to bring forth the spirits of those who had perished, allowing Dhritarashtra and others to witness them. He also guided the widows of fallen warriors, instructing them on traditional rites.\n\n\n== Other accounts ==\n\nVyāsa had a son named Shuka, who was his spiritual successor and heir. As per Skanda Purana, Vyasa married Vatikā, alias Pinjalā, who was the daughter of a sage named Jābāli. It is described that Vyasa's union with her produced his heir, who repeated everything that he heard, thus receiving the name Shuka (lit. Parrot). Other texts including the Devi Bhagavata Purana also narrate the birth of Shuka but with drastic differences. Vyasa was desiring an heir, when an apsara (celestial damsel) named Ghritachi flew in front of him in the form of a beautiful parrot, causing him sexual arousal. He discharges his semen, which falls on some sticks and a son develops. This time, he was named Shuka because of the role of the celestial parrot. Shuka appears occasionally in the story as a spiritual guide to the young Kuru princes.\nBesides his heir, Vyasa had four other disciples—Paila, Jaimini, Vaishampayana and Sumantu. Each one of them was given the responsibility to spread one of the four Vedas. Paila was the made the incharge of Rigveda, Jaimini of the Samaveda, Vaishampayana of the Yajurveda and Sumantu of Atharvaveda.\nVyasa is believed to have lived on the banks of Gangā in modern-day Uttarākhaṇd. The site was also the ritual home of the sage Vashishta, along with the Pāṇḍavas, the five brothers of the Mahābhārata.\nVyāsa is also mentioned in the Śankara Digvijaya. He confronts Ādi Shankara, who has written a commentary on the Brahma-Sutras, in the form of an old Brahmana, and asks for an explanation of the first Sutra. This develops into a debate between Shankara and Vyāsa which lasts for eight days. Recognizing the old Brahmana to be Vyāsa, Shankara makes obeisance and sings a hymn in his praise. Thereupon, Vyasa inspects and approves Shankara's commentary on the Brahma-Sutras. Adi Shankara, who was supposed to die at the end of his sixteenth year, expresses his desire to leave his body in the presence of Vyāsa. Vyāsa dissuades him and blesses him so that he may live for another sixteen years to complete his work.\n\n\n== Festival ==\nThe festival of Guru Purnima is dedicated to Vyasa. It is also known as Vyasa Purnima, the day believed to be both of his birth and when he divided the Vedas.\n\n\n== In Sikhism ==\nIn Brahm Avtar, one of the compositions in Dasam Granth, Guru Gobind Singh mentions Rishi Vyas as an avatar of Brahma. He is considered the fifth incarnation of Brahma. Guru Gobind Singh wrote a brief account of Rishi Vyas's compositions about great kings—Manu, Prithu, Bharath, Jujat, Ben, Mandata, Dilip, Raghu Raj and Aj—and attributed to him the store of Vedic learning.\n\n\n== See also ==\n\nChiranjivi\nGuru Gita\nGnana Saraswati Temple, Basar\nParashara\nVedic mythology\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n== Further reading ==\nThe Mahabharata of Krishna-Dwaipayana Vyasa, translated by Kisari Mohan Ganguli, published between 1883 and 1896\nThe Arthashastra, translated by Shamasastry, 1915\nThe Vishnu-Purana, translated by H. H. Wilson, 1840\nThe Bhagavata-Purana, translated by A. C. Bhaktivedanta Swami Prabhupada, 1988 copyright Bhaktivedanta Book Trust\nThe Jataka or Stories of the Buddha's Former Births, edited by E. B. Cowell, 1895\n\n\n== External links ==\n Quotations related to Vyasa at Wikiquote\n Media related to Vyasa at Wikimedia Commons\n Works by or about Vyasa at Wikisource\nThe Mahābhārata – Ganguli translation, full text at sacred-texts.com",
    "url": "https://en.wikipedia.org/wiki/Vyasa",
    "related_articles": [
      "Maharishi Mahesh Yogi",
      "Historical Vedic religion",
      "Adivasi",
      "Hindu denominations"
    ]
  },
  "timestamp": 1748508418.9831884
}