{
  "subject": "history",
  "topic": "vedas",
  "wikipedia": {
    "title": "Vedas",
    "summary": "The Vedas ( or ; Sanskrit: वेदः, romanized: Vēdaḥ, lit. 'knowledge'), sometimes collectively called the Veda, are a large body of religious texts originating in ancient India. Composed in Vedic Sanskrit, the texts constitute the oldest layer of Sanskrit literature and the oldest scriptures of Hinduism.\nThere are four Vedas: the Rigveda, the Yajurveda, the Samaveda and the Atharvaveda. Each Veda has four subdivisions – the Samhitas (mantras and benedictions), the Brahmanas (commentaries on and explanation of rituals, ceremonies and sacrifices – Yajñas), the Aranyakas (text on rituals, ceremonies, sacrifices and symbolic-sacrifices), and the Upanishads (texts discussing meditation, philosophy and spiritual knowledge). Some scholars add a fifth category – the Upāsanās (worship). The texts of the Upanishads discuss ideas akin to the heterodox sramana traditions. The Samhitas and Brahmanas describe daily rituals and are generally meant for the Brahmacharya and Gr̥hastha stages of the Chaturashrama system, while the Aranyakas and Upanishads are meant for the Vānaprastha and Sannyasa stages, respectively.\nVedas are śruti (\"what is heard\"), distinguishing them from other religious texts, which are called smr̥ti (\"what is remembered\"). Hindus consider the Vedas to be apauruṣeya, which means \"not of a man, superhuman\" and \"impersonal, authorless\", revelations of sacred sounds and texts heard by ancient sages after intense meditation.\nThe Vedas have been orally transmitted since the 2nd millennium BCE with the help of elaborate mnemonic techniques. The mantras, the oldest part of the Vedas, are recited in the modern age for their phonology rather than the semantics, and are considered to be \"primordial rhythms of creation\", preceding the forms to which they refer. By reciting them the cosmos is regenerated, \"by enlivening and nourishing the forms of creation at their base.\"\nThe various Indian philosophies and Hindu sects have taken differing positions on the Vedas. Schools of Indian philosophy that acknowledge the importance or primal authority of the Vedas comprise Hindu philosophy specifically and are together classified as the six \"orthodox\" (āstika) schools. However, śramaṇa traditions, such as Charvaka, Ajivika, Buddhism, and Jainism, which did not regard the Vedas as authoritative, are referred to as \"heterodox\" or \"non-orthodox\" (nāstika) schools.",
    "content": "The Vedas ( or ; Sanskrit: वेदः, romanized: Vēdaḥ, lit. 'knowledge'), sometimes collectively called the Veda, are a large body of religious texts originating in ancient India. Composed in Vedic Sanskrit, the texts constitute the oldest layer of Sanskrit literature and the oldest scriptures of Hinduism.\nThere are four Vedas: the Rigveda, the Yajurveda, the Samaveda and the Atharvaveda. Each Veda has four subdivisions – the Samhitas (mantras and benedictions), the Brahmanas (commentaries on and explanation of rituals, ceremonies and sacrifices – Yajñas), the Aranyakas (text on rituals, ceremonies, sacrifices and symbolic-sacrifices), and the Upanishads (texts discussing meditation, philosophy and spiritual knowledge). Some scholars add a fifth category – the Upāsanās (worship). The texts of the Upanishads discuss ideas akin to the heterodox sramana traditions. The Samhitas and Brahmanas describe daily rituals and are generally meant for the Brahmacharya and Gr̥hastha stages of the Chaturashrama system, while the Aranyakas and Upanishads are meant for the Vānaprastha and Sannyasa stages, respectively.\nVedas are śruti (\"what is heard\"), distinguishing them from other religious texts, which are called smr̥ti (\"what is remembered\"). Hindus consider the Vedas to be apauruṣeya, which means \"not of a man, superhuman\" and \"impersonal, authorless\", revelations of sacred sounds and texts heard by ancient sages after intense meditation.\nThe Vedas have been orally transmitted since the 2nd millennium BCE with the help of elaborate mnemonic techniques. The mantras, the oldest part of the Vedas, are recited in the modern age for their phonology rather than the semantics, and are considered to be \"primordial rhythms of creation\", preceding the forms to which they refer. By reciting them the cosmos is regenerated, \"by enlivening and nourishing the forms of creation at their base.\"\nThe various Indian philosophies and Hindu sects have taken differing positions on the Vedas. Schools of Indian philosophy that acknowledge the importance or primal authority of the Vedas comprise Hindu philosophy specifically and are together classified as the six \"orthodox\" (āstika) schools. However, śramaṇa traditions, such as Charvaka, Ajivika, Buddhism, and Jainism, which did not regard the Vedas as authoritative, are referred to as \"heterodox\" or \"non-orthodox\" (nāstika) schools.\n\n\n== Etymology and usage ==\nThe Sanskrit word véda \"knowledge, wisdom\" is derived from the root vid- \"to know\". This is reconstructed as being derived from the Proto-Indo-European root *weyd-, meaning \"see\" or \"know\".\nThe noun is from Proto-Indo-European *weydos, cognate to Greek (ϝ)εἶδος \"aspect\", \"form\" . This is not to be confused with the homonymous 1st and 3rd person singular perfect tense véda, cognate to Greek (ϝ)οἶδα ((w)oida) \"I know\". Root cognates are Greek ἰδέα, English wit, Latin videō \"I see\", Russian ве́дать (védat') \"to know\", etc.\nThe Sanskrit term veda as a common noun means \"knowledge\". The term in some contexts, such as hymn 10.93.11 of the Rigveda, means \"obtaining or finding wealth, property\", while in some others it means \"a bunch of grass together\" as in a broom or for ritual fire.\n\n\n== Vedic texts ==\n\n\n=== Vedic Sanskrit corpus ===\nThe term \"Vedic texts\" is used in two distinct meanings:\n\nTexts composed in Vedic Sanskrit during the Vedic period (Iron Age India)\nAny text considered as \"connected to the Vedas\" or a \"corollary of the Vedas\"\nThe corpus of Vedic Sanskrit texts includes:\n\nThe Samhitas (Sanskrit saṃhitā, \"collection\"), are collections of metric texts (\"mantras\"). There are four \"Vedic\" Samhitas: the Rig-Veda, Yajur-Veda, Sama-Veda and Atharva-Veda, most of which are available in several recensions (śākhā). In some contexts, the term Veda is used to refer only to these Samhitas, the collection of mantras. This is the oldest layer of Vedic texts, which were composed between c. 1500–1200 BCE (Rig Veda book 2–9), and 1200–900 BCE for the other Samhitas. The Samhitas contain invocations to deities like Indra and Agni, \"to secure their benediction for success in battles or for welfare of the clan.\" The complete corpus of Vedic mantras as collected in Bloomfield's Vedic Concordance (1907) consists of some 89,000 padas (metrical feet), of which 72,000 occur in the four Samhitas.\nThe Brahmanas are prose texts that comment on and explain the solemn rituals as well as expound on their meaning and many connected themes. Each of the Brahmanas is associated with one of the Samhitas or its recensions. The oldest dated to about 900 BCE, while the youngest Brahmanas (such as the Shatapatha Brahmana), were complete by about 700 BCE. The Brahmanas may either form separate texts or can be partly integrated into the text of the Samhitas. They may also include the Aranyakas and Upanishads.\nThe Aranyakas, \"wilderness texts\" or \"forest treaties\", were composed by people who meditated in the woods as recluses and are the third part of the Vedas. The texts contain discussions and interpretations of ceremonies, from ritualistic to symbolic meta-ritualistic points of view. It is frequently read in secondary literature.\nOlder Principal Upanishads (Bṛhadāraṇyaka, Chandogya, Kaṭha, Kena, Aitareya, and others), composed between 800 BCE and the end of the Vedic period. The Upanishads are largely philosophical works, some in dialogue form. They are the foundation of Hindu philosophical thought and its diverse traditions. Of the Vedic corpus, they alone are widely known, and the central ideas of the Upanishads are still influential in Hinduism.\nThe texts considered \"Vedic\" in the sense of \"corollaries of the Vedas\" are less clearly defined, and may include numerous post-Vedic texts such as the later Upanishads and the Sutra literature, such as Shrauta Sutras and Gryha Sutras, which are smriti texts. Together, the Vedas and these Sutras form part of the Vedic Sanskrit corpus.\nWhile production of Brahmanas and Aranyakas ceased with the end of the Vedic period, additional Upanishads were composed after the end of the Vedic period. The Brahmanas, Aranyakas, and Upanishads, among other things, interpret and discuss the Samhitas in philosophical and metaphorical ways to explore abstract concepts such as the Absolute (Brahman), and the soul or the self (Atman), introducing Vedanta philosophy, one of the major trends of later Hinduism. In other parts, they show evolution of ideas, such as from actual sacrifice to symbolic sacrifice, and of spirituality in the Upanishads. This has inspired later Hindu scholars such as Adi Shankara to classify each Veda into karma-kanda (कर्म खण्ड, action/sacrificial ritual-related sections, the Samhitas and Brahmanas); and jnana-kanda (ज्ञान खण्ड, knowledge/spirituality-related sections, mainly the Upanishads').\n\n\n=== Śruti and smṛti ===\nVedas are śruti (\"what is heard\"), distinguishing them from other religious texts, which are called smṛti (\"what is remembered\"). This indigenous system of categorization was adopted by Max Müller and, while it is subject to some debate, it is still widely used. As Axel Michaels explains:\n\nThese classifications are often not tenable for linguistic and formal reasons: There is not only one collection at any one time, but rather several handed down in separate Vedic schools; Upanişads [...] are sometimes not to be distinguished from Āraṇyakas [...]; Brāhmaṇas contain older strata of language attributed to the Saṃhitās; there are various dialects and locally prominent traditions of the Vedic schools. Nevertheless, it is advisable to stick to the division adopted by Max Müller because it follows the Indian tradition, conveys the historical sequence fairly accurately, and underlies the current editions, translations, and monographs on Vedic literature.\"\nAmong the widely known śrutis include the Vedas and their embedded texts – the Samhitas, the Upanishads, the Brahmanas and the Aranyakas. The well-known smṛtis include Bhagavad Gita, Bhagavata Purana and the epics Ramayana and Mahabharata, amongst others.\n\n\n=== Authorship ===\nHindus consider the Vedas to be apauruṣeyā, which means \"not of a man, superhuman\" and \"impersonal, authorless\". The Vedas, for orthodox Indian theologians, are considered revelations seen by ancient sages after intense meditation, and texts that have been more carefully preserved since ancient times. In the Hindu Epic Mahabharata, the creation of Vedas is credited to Brahma. The Vedic hymns themselves assert that they were skillfully created by Rishis (sages), after inspired creativity, just as a carpenter builds a chariot.\nThe oldest part of the Rig Veda Samhita was orally composed in north-western India (Punjab) between c. 1500 and 1200 BCE, while book 10 of the Rig Veda, and the other Samhitas were composed between 1200 and 900 BCE more eastward, between the Yamuna and the Ganges rivers, the heartland of Aryavarta and the Kuru Kingdom (c. 1200 – c. 900 BCE). The \"circum-Vedic\" texts, as well as the redaction of the Samhitas, date to c. 1000–500 BCE.\nAccording to tradition, Vyasa is the compiler of the Vedas, who arranged the four kinds of mantras into four Samhitas (Collections).\n\n\n== Chronology, transmission, and interpretation ==\n\n\n=== Chronology ===\nThe Vedas are among the oldest sacred texts. The bulk of the Rigveda Samhita was composed in the northwestern region (Punjab) of the Indian subcontinent, most likely between c. 1500 and 1200 BCE, although a wider approximation of c. 1700–1100 BCE has also been given. The other three Samhitas are considered to date from the time of the Kuru Kingdom, approximately c. 1200–900 BCE. The \"circum-Vedic\" texts, as well as the redaction of the Samhitas, date to c. 1000–500 BCE, resulting in a Vedic period, spanning the mid 2nd to mid 1st millennium BCE, or the Late Bronze Age and the Iron Age. The Vedic period reaches its peak only after the composition of the mantra texts, with the establishment of the various shakhas all over Northern India which annotated the mantra samhitas with Brahmana discussions of their meaning, and reaches its end in the age of Buddha and Panini and the rise of the Mahajanapadas (archaeologically, Northern Black Polished Ware). Michael Witzel gives a time span of c. 1500 to c. 500–400 BCE. Witzel makes special reference to the Near Eastern Mitanni material of the 14th century BCE, the only epigraphic record of Indo-Aryan contemporary to the Rigvedic period. He gives 150 BCE (Patañjali) as a terminus ante quem for all Vedic Sanskrit literature, and 1200 BCE (the early Iron Age) as terminus post quem for the Atharvaveda.\n\n\n=== Transmission ===\nThe Vedas were orally transmitted since their composition in the Vedic period for several millennia. The authoritative transmission of the Vedas is by an oral tradition in a sampradaya from father to son or from teacher (guru) to student (shishya), believed to be initiated by the Vedic rishis who heard the primordial sounds. Only this tradition, embodied by a living teacher, can teach the correct pronunciation of the sounds and explain hidden meanings, in a way the \"dead and entombed manuscript\" cannot do. As Leela Prasad states, \"According to Shankara, the \"correct tradition\" (sampradaya) has as much authority as the written Shastra\", explaining that the tradition \"bears the authority to clarify and provide direction in the application of knowledge\".\nThe emphasis in this transmission is on the \"proper articulation and pronunciation of the Vedic sounds\", as prescribed in the Shiksha, the Vedanga (Vedic study) of sound as uttered in a Vedic recitation, mastering the texts \"literally forward and backward in fully acoustic fashion\". Houben and Rath note that the Vedic textual tradition cannot simply be characterized as oral, \"since it also depends significantly on a memory culture\". The Vedas were preserved with precision with the help of elaborate mnemonic techniques, such as memorizing the texts in eleven different modes of recitation (pathas), using the alphabet as a mnemotechnical device, \"matching physical movements (such as nodding the head) with particular sounds and chanting in a group\" and visualizing sounds by using mudras (hand signs). This provided an additional visual confirmation, and also an alternate means to check the reading integrity by the audience, in addition to the audible means. Houben and Rath note that a strong \"memory culture\" existed in ancient India when texts were transmitted orally, before the advent of writing in the early first millennium CE. According to Staal, criticising the Goody-Watt hypothesis \"according to which literacy is more reliable than orality\", this tradition of oral transmission \"is closely related to Indian forms of science\" and \"by far the more remarkable\" than the relatively recent tradition of written transmission.\nWhile according to Mookerji, understanding the meaning (vedarthajnana or artha-bodha) of the words of the Vedas was part of the Vedic learning, Holdrege and other Indologists have noted that in the transmission of the Samhitas, the emphasis is on the phonology of the sounds (śabda) and not on the meaning (artha) of the mantras. Already at the end of the Vedic period their original meaning had become obscure for \"ordinary people\", and niruktas, etymological compendia, were developed to preserve and clarify the original meaning of many Sanskrit words. According to Staal, as referenced by Holdrege, though the mantras may have a discursive meaning, when the mantras are recited in the Vedic rituals \"they are disengaged from their original context and are employed in ways that have little or nothing to do with their meaning\". The words of the mantras are \"themselves sacred\", and \"do not constitute linguistic utterances\". Instead, as Klostermaier notes, in their application in Vedic rituals they become magical sounds, \"means to an end\". Holdrege notes that there are scarce commentaries on the meaning of the mantras, in contrast to the number of commentaries on the Brahmanas and Upanishads, but states that the lack of emphasis on the \"discursive meaning does not necessarily imply that they are meaningless\". In the Brahmanical perspective, the sounds have their own meaning, mantras are considered as \"primordial rhythms of creation\", preceding the forms to which they refer. By reciting them the cosmos is regenerated, \"by enlivening and nourishing the forms of creation at their base. As long as the purity of the sounds is preserved, the recitation of the mantras will be efficacious, irrespective of whether their discursive meaning is understood by human beings.\" Frazier further notes that \"later Vedic texts sought deeper understanding of the reasons the rituals worked\", which indicates that the Brahmin communities considered study to be a \"process of understanding\".\nA literary tradition is traceable in post-Vedic times, after the rise of Buddhism in the Maurya period, perhaps earliest in the Kanva recension of the Yajurveda about the 1st century BCE; however oral tradition of transmission remained active. Jack Goody has argued for an earlier literary tradition, concluding that the Vedas bear hallmarks of a literate culture along with oral transmission, but Goody's views have been strongly criticised by Falk, Lopez Jr,. and Staal, though they have also found some support.\nThe Vedas were written down only after 500 BCE, but only the orally transmitted texts are regarded as authoritative, given the emphasis on the exact pronunciation of the sounds. Witzel suggests that attempts to write down the Vedic texts towards the end of 1st millennium BCE were unsuccessful, resulting in smriti rules explicitly forbidding the writing down of the Vedas. Due to the ephemeral nature of the manuscript material (birch bark or palm leaves), surviving manuscripts rarely surpass an age of a few hundred years. The Sampurnanand Sanskrit University has a Rigveda manuscript from the 14th century; however, there are a number of older Veda manuscripts in Nepal that are dated from the 11th century onwards.\n\n\n=== Vedic learning ===\n\nThe Vedas, Vedic rituals and its ancillary sciences called the Vedangas, were part of the curriculum at ancient universities such as at Taxila, Nalanda and Vikramashila. According to Deshpande, \"the tradition of the Sanskrit grammarians also contributed significantly to the preservation and interpretation of Vedic texts.\" Yāska (4th c. BCE) wrote the Nirukta, which reflects the concerns about the loss of meaning of the mantras, while Pāṇinis (4th c. BCE) Aṣṭādhyāyī is the most important surviving text of the Vyākaraṇa traditions. Mimamsa scholar Sayanas (14th c. CE) major Vedartha Prakasha is a rare commentary on the Vedas, which is also referred to by contemporary scholars.\nYaska and Sayana, reflecting an ancient understanding, state that the Veda can be interpreted in three ways, giving \"the truth about gods, dharma and parabrahman.\" The pūrva-kāņda (or karma-kanda), the part of the Veda dealing with ritual, gives knowledge of dharma, \"which brings us satisfaction.\" The uttara-kanda (or jnana-kanda), the part of the Veda dealing with the knowledge of the absolute, gives knowledge of Parabrahma, \"which fulfills all of our desires.\" According to Holdrege, for the exponents of karma-kandha the Veda is to be \"inscribed in the minds and hearts of men\" by memorization and recitation, while for the exponents of the jnana-kanda and meditation the Vedas express a transcendental reality which can be approached with mystical means.\nHoldrege notes that in Vedic learning \"priority has been given to recitation over interpretation\" of the Samhitas. Galewicz states that Sayana, a Mimamsa scholar, \"thinks of the Veda as something to be trained and mastered to be put into practical ritual use\", noticing that \"it is not the meaning of the mantras that is most essential [...] but rather the perfect mastering of their sound form.\" According to Galewicz, Sayana saw the purpose (artha) of the Veda as the \"artha of carrying out sacrifice\", giving precedence to the Yajurveda. For Sayana, whether the mantras had meaning depended on the context of their practical usage. This conception of the Veda, as a repertoire to be mastered and performed, takes precedence over the internal meaning or \"autonomous message of the hymns.\" Most Śrauta rituals are not performed in the modern era, and those that are, are rare.\nMukherjee notes that the Rigveda, and Sayana's commentary, contain passages criticizing as fruitless mere recitation of the Ŗik (words) without understanding their inner meaning or essence, the knowledge of dharma and Parabrahman. Mukherjee concludes that in the Rigvedic education of the mantras \"the contemplation and comprehension of their meaning was considered as more important and vital to education than their mere mechanical repetition and correct pronunciation.\" Mookei refers to Sayana as stating that \"the mastery of texts, akshara-praptī, is followed by artha-bodha, perception of their meaning.\" Mukherjee explains that the Vedic knowledge was first perceived by the rishis and munis. Only the perfect language of the Vedas, as in contrast to ordinary speech, can reveal these truths, which were preserved by committing them to memory. According to Mukherjee, while these truths are imparted to the student by the memorized texts, \"the realization of Truth\" and the knowledge of paramatman as revealed to the rishis is the real aim of Vedic learning, and not the mere recitation of texts. The supreme knowledge of the Absolute, para Brahman-jnana, the knowledge of rta and satya, can be obtained by taking vows of silence and obedience sense-restraint, dhyana, the practice of tapas (austerities), and discussing the Vedanta.\n\n\n== Vedic schools or recensions ==\n\nThe four Vedas were transmitted in various śākhās (branches, schools). Each school likely represented an ancient community of a particular area, or kingdom. Each school followed its own canon. Multiple recensions (revisions) are known for each of the Vedas. Thus, states Witzel as well as Renou, in the 2nd millennium BCE, there was likely no canon of one broadly accepted Vedic texts, no Vedic “Scripture”, but only a canon of various texts accepted by each school. Some of these texts have survived, most lost or yet to be found. Rigveda that survives in modern times, for example, is in only one extremely well preserved school of Śåkalya, from a region called Videha, in modern north Bihar, south of Nepal. The Vedic canon in its entirety consists of texts from all the various Vedic schools taken together.\nThere were Vedic schools that believed in polytheism in which numerous gods had different natural functions, henotheistic beliefs where only one god was worshipped but others were thought to exist, monotheistic beliefs in a single god, agnosticism, and monistic beliefs where \"there is an absolute reality that goes beyond the gods and that includes or transcends everything that exists.\" Indra, Agni, and Yama were popular subjects of worship by polytheist organizations.\nEach of the four Vedas were shared by the numerous schools, but revised, interpolated and adapted locally, in and after the Vedic period, giving rise to various recensions of the text. Some texts were revised into the modern era, raising significant debate on parts of the text which are believed to have been corrupted at a later date. The Vedas each have an Index or Anukramani, the principal work of this kind being the general Index or Sarvānukramaṇī.\nProdigious energy was expended by ancient Indian culture in ensuring that these texts were transmitted from generation to generation with inordinate fidelity. For example, memorization of the sacred Vedas included up to eleven forms of recitation of the same text. The texts were subsequently \"proof-read\" by comparing the different recited versions. Forms of recitation included the jaṭā-pāṭha (literally \"mesh recitation\") in which every two adjacent words in the text were first recited in their original order, then repeated in the reverse order, and finally repeated in the original order. That these methods have been effective, is attested to by the preservation of the most ancient Indian religious text, the Rigveda, as redacted into a single text during the Brahmana period, without any variant readings within that school.\nThe Vedas were orally transmitted by memorization, and were written down only after 500 BCE, All printed editions of the Vedas that survive in the modern times are likely the version existing in about the 16th century CE.\n\n\n== Four Vedas ==\n\nThe canonical division of the Vedas is fourfold (turīya) viz.,\n\nRigveda (RV)\nYajurveda (YV, with the main division TS vs. VS)\nSamaveda (SV)\nAtharvaveda (AV)\nOf these, the first three were the principal original division, also called \"trayī vidyā\"; that is, \"the triple science\" of reciting hymns (Rigveda), performing sacrifices (Yajurveda), and chanting songs (Samaveda). The Rig Veda most likely was composed between c. 1500 BCE and 1200 BCE. Witzel notes that it is the Vedic period itself, where incipient lists divide the Vedic texts into three (trayī) or four branches: Rig, Yajur, Sama and Atharva.\nEach Veda has been subclassified into four major text types – the Samhitas (mantras and benedictions), the Aranyakas (text on rituals, ceremonies such as newborn baby's rites of passage, coming of age, marriages, retirement and cremation, sacrifices and symbolic sacrifices), the Brahmanas (commentaries on rituals, ceremonies and sacrifices), and the Upanishads (text discussing meditation, philosophy and spiritual knowledge). The Upasanas (short ritual worship-related sections) are considered by some scholars as the fifth part. Witzel notes that the rituals, rites and ceremonies described in these ancient texts reconstruct to a large degree the Indo-European marriage rituals observed in a region spanning the Indian subcontinent, Persia and the European area, and some greater details are found in the Vedic era texts such as the Grhya Sūtras.\nOnly one version of the Rigveda is known to have survived into the modern era. Several different versions of the Sama Veda and the Atharva Veda are known, and many different versions of the Yajur Veda have been found in different parts of South Asia.\nThe texts of the Upanishads discuss ideas akin to the heterodox sramana-traditions.\n\n\n=== Rigveda ===\n\nThe Rigveda Samhita is the oldest extant Indic text. It is a collection of 1,028 Vedic Sanskrit hymns and 10,600 verses in all, organized into ten books (Sanskrit: mandalas). The hymns are dedicated to Rigvedic deities.\nThe books were composed by poets from different priestly groups over a period of several centuries between c. 1500 and 1200 BCE, (the early Vedic period) in the Punjab (Sapta Sindhu) region of the northwest Indian subcontinent. According to Michael Witzel, the initial codification of the Rigveda took place at the end of the Rigvedic period at c. 1200 BCE, in the early Kuru kingdom.\nThe Rigveda is structured based on clear principles. The Veda begins with a small book addressed to Agni, Indra, Soma and other gods, all arranged according to decreasing total number of hymns in each deity collection; for each deity series, the hymns progress from longer to shorter ones, but the number of hymns per book increases. Finally, the meter too is systematically arranged from jagati and tristubh to anustubh and gayatri as the text progresses.\nThe rituals became increasingly complex over time, and the king's association with them strengthened both the position of the Brahmans and the kings. The Rajasuya rituals, performed with the coronation of a king, \"set in motion [...] cyclical regenerations of the universe.\" In terms of substance, the nature of hymns shift from praise of deities in early books to Nasadiya Sukta with questions such as, \"what is the origin of the universe?, do even gods know the answer?\", the virtue of Dāna (charity) in society, and other metaphysical issues in its hymns.\nThere are similarities between the mythology, rituals and linguistics in Rigveda and those found in ancient central Asia, Iranian and Hindukush (Afghanistan) regions.\n\n\n=== Yajurveda ===\n\nThe Yajurveda Samhita consists of prose mantras. It is a compilation of ritual offering formulas that were said by a priest while an individual performed ritual actions such as those before the yajna fire. The core text of the Yajurveda falls within the classical Mantra period of Vedic Sanskrit at the end of the 2nd millennium BCE – younger than the Rigveda, and roughly contemporary with the Atharvaveda, the Rigvedic Khilani, and the Sāmaveda. Witzel dates the Yajurveda hymns to the early Indian Iron Age, after c. 1200 and before 800 BCE. corresponding to the early Kuru Kingdom.\n\nThe earliest and most ancient layer of Yajurveda samhita includes about 1,875 verses, that are distinct yet borrow and build upon the foundation of verses in Rigveda. Unlike the Samaveda which is almost entirely based on Rigveda mantras and structured as songs, the Yajurveda samhitas are in prose, and they are different from earlier Vedic texts linguistically. The Yajur Veda has been the primary source of information about sacrifices during Vedic times and associated rituals.\nThere are two major groups of texts in this Veda: the \"Black\" (Krishna) and the \"White\" (Shukla). The term \"black\" implies \"the un-arranged, motley collection\" of verses in Yajurveda, in contrast to the \"white\" (well arranged) Yajurveda. The White Yajurveda separates the Samhita from its Brahmana (the Shatapatha Brahmana), the Black Yajurveda intersperses the Samhita with Brahmana commentary. Of the Black Yajurveda, texts from four major schools have survived (Maitrayani, Katha, Kapisthala-Katha, Taittiriya), while of the White Yajurveda, two (Kanva and Madhyandina). The youngest layer of Yajurveda text is not related to rituals nor sacrifice, it includes the largest collection of primary Upanishads, influential to various schools of Hindu philosophy.\n\n\n=== Samaveda ===\n\nThe Samaveda Samhita consists of 1549 stanzas, taken almost entirely (except for 75 mantras) from the Rigveda. While its earliest parts are believed to date from as early as the Rigvedic period, the existing compilation dates from the post-Rigvedic Mantra period of Vedic Sanskrit, between c. 1200 and 1000 BCE or \"slightly later\", roughly contemporary with the Atharvaveda and the Yajurveda.\nThe Samaveda samhita has two major parts. The first part includes four melody collections (gāna, गान) and the second part three verse “books” (ārcika, आर्चिक). A melody in the song books corresponds to a verse in the arcika books. Just as in the Rigveda, the early sections of Samaveda typically begin with hymns to Agni and Indra but shift to the abstract. Their meters shift also in a descending order. The songs in the later sections of the Samaveda have the least deviation from the hymns derived from the Rigveda.\nIn the Samaveda, some of the Rigvedic verses are repeated. Including repetitions, there are a total of 1875 verses numbered in the Samaveda recension translated by Griffith. Two major recensions have survived, the Kauthuma/Ranayaniya and the Jaiminiya. Its purpose was liturgical, and they were the repertoire of the udgātṛ or \"singer\" priests.\n\n\n=== Atharvaveda ===\n\nThe Artharvaveda Samhita is the text 'belonging to the Atharvan and Angirasa poets. It has about 760 hymns, and about 160 of the hymns are in common with the Rigveda. Most of the verses are metrical, but some sections are in prose. Two different versions of the text – the Paippalāda and the Śaunakīya – have survived into the modern times. The Atharvaveda was not considered as a Veda in the Vedic era, and was accepted as a Veda in late 1st millennium BCE. It was compiled last, probably around 900 BCE, although some of its material may go back to the time of the Rigveda, or earlier.\nThe Atharvaveda is sometimes called the \"Veda of magical formulas\", an epithet declared to be incorrect by other scholars. The Samhita layer of the text likely represents a developing 2nd millennium BCE tradition of magico-religious rites to address superstitious anxiety, spells to remove maladies believed to be caused by demons, and herbs- and nature-derived potions as medicine. The text, states Kenneth Zysk, is one of oldest surviving record of the evolutionary practices in religious medicine and reveals the \"earliest forms of folk healing of Indo-European antiquity\". Many books of the Atharvaveda Samhita are dedicated to rituals without magic, such as to philosophical speculations and to theosophy.\nThe Atharva veda has been a primary source for information about Vedic culture, the customs and beliefs, the aspirations and frustrations of everyday Vedic life, as well as those associated with kings and governance. The text also includes hymns dealing with the two major rituals of passage – marriage and cremation. The Atharva Veda also dedicates significant portion of the text asking the meaning of a ritual.\n\n\n=== Embedded Vedic texts ===\n\n\n==== Brahmanas ====\n\nThe Brahmanas are commentaries, explanation of proper methods and meaning of Vedic Samhita rituals in the four Vedas. They also incorporate myths, legends and in some cases philosophy. Each regional Vedic shakha (school) has its own operating manual-like Brahmana text, most of which have been lost. A total of 19 Brahmana texts have survived into modern times: two associated with the Rigveda, six with the Yajurveda, ten with the Samaveda and one with the Atharvaveda. The oldest dated to about 900 BCE, while the youngest Brahmanas (such as the Shatapatha Brahmana), were complete by about 700 BCE. According to Jan Gonda, the final codification of the Brahmanas took place in pre-Buddhist times (ca. 600 BCE).\nThe substance of the Brahmana text varies with each Veda. For example, the first chapter of the Chandogya Brahmana, one of the oldest Brahmanas, includes eight ritual suktas (hymns) for the ceremony of marriage and rituals at the birth of a child. The first hymn is a recitation that accompanies offering a Yajna oblation to Agni (fire) on the occasion of a marriage, and the hymn prays for prosperity of the couple getting married. The second hymn wishes for their long life, kind relatives, and a numerous progeny. The third hymn is a mutual marriage pledge, between the bride and groom, by which the two bind themselves to each other. The sixth through last hymns of the first chapter in Chandogya Brahmana are ritual celebrations on the birth of a child and wishes for health, wealth, and prosperity with a profusion of cows and artha. However, these verses are incomplete expositions, and their complete context emerges only with the Samhita layer of text.\n\n\n==== Aranyakas and Upanishads ====\n\nThe Aranyakas layer of the Vedas include rituals, discussion of symbolic meta-rituals, as well as philosophical speculations.\nAranyakas, however, neither are homogeneous in content nor in structure. They are a medley of instructions and ideas, and some include chapters of Upanishads within them. Two theories have been proposed on the origin of the word Aranyakas. One theory holds that these texts were meant to be studied in a forest, while the other holds that the name came from these being the manuals of allegorical interpretation of sacrifices, for those in Vanaprastha (retired, forest-dwelling) stage of their life, according to the historic age-based Ashrama system of human life.\nThe Upanishads reflect the last composed layer of texts in the Vedas. They are commonly referred to as Vedānta, variously interpreted to mean either the \"last chapters, parts of the Vedas\" or \"the object, the highest purpose of the Veda\". \nThe central concern of the Upanishads are the connections \"between parts of the human organism and cosmic realities.\" The Upanishads intend to create a hierarchy of connected and dependent realities, evoking a sense of unity of \"the separate elements of the world and of human experience [compressing] them into a single form.\" The concepts of Brahman, the Ultimate Reality from which everything arises, and Ātman, the essence of the individual, are central ideas in the Upanishads, and knowing the correspondence between Ātman and Brahman as \"the fundamental principle which shapes the world\" permits the creation of an integrative vision of the whole. The Upanishads are the foundation of Hindu philosophical thought and its diverse traditions, and of the Vedic corpus, they alone are widely known, and the central ideas of the Upanishads have influenced the diverse traditions of Hinduism.\nAranyakas are sometimes identified as karma-kanda (ritualistic section), while the Upanishads are identified as jnana-kanda (spirituality section). In an alternate classification, the early part of Vedas are called Samhitas and the commentary are called the Brahmanas which together are identified as the ceremonial karma-kanda, while Aranyakas and Upanishads are referred to as the jnana-kanda.\n\n\n== Post-Vedic literature ==\n\n\n=== Vedanga ===\n\nThe Vedangas developed towards the end of the vedic period, around or after the middle of the 1st millennium BCE. These auxiliary fields of Vedic studies emerged because the language of the Vedas, composed centuries earlier, became too archaic to the people of that time. The Vedangas were sciences that focused on helping understand and interpret the Vedas that had been composed many centuries earlier.\nThe six subjects of Vedanga are phonetics (Śikṣā), poetic meter (Chandas), grammar (Vyākaraṇa), etymology and linguistics (Nirukta), rituals and rites of passage (Kalpa), time keeping and astronomy (Jyotiṣa).\nVedangas developed as ancillary studies for the Vedas, but its insights into meters, structure of sound and language, grammar, linguistic analysis and other subjects influenced post-Vedic studies, arts, culture and various schools of Hindu philosophy. The Kalpa Vedanga studies, for example, gave rise to the Dharma-sutras, which later expanded into Dharma-shastras.\n\n\n=== Parisista ===\n\nPariśiṣṭa \"supplement, appendix\" is the term applied to various ancillary works of Vedic literature, dealing mainly with details of ritual and elaborations of the texts logically and chronologically prior to them: the Samhitas, Brahmanas, Aranyakas and Sutras. Naturally classified with the Veda to which each pertains, Parisista works exist for each of the four Vedas. However, only the literature associated with the Atharvaveda is extensive.\n\nThe Āśvalāyana Gṛhya Pariśiṣṭa is a very late text associated with the Rigveda canon.\nThe Gobhila Gṛhya Pariśiṣṭa is a short metrical text of two chapters, with 113 and 95 verses respectively.\nThe Kātiya Pariśiṣṭas, ascribed to Kātyāyana, consist of 18 works enumerated self-referentially in the fifth of the series (the Caraṇavyūha) and the Kātyāyana Śrauta Sūtra Pariśiṣṭa.\nThe Kṛṣṇa Yajurveda has 3 parisistas The Āpastamba Hautra Pariśiṣṭa, which is also found as the second praśna of the Satyasāḍha Śrauta Sūtra', the Vārāha Śrauta Sūtra Pariśiṣṭa\nFor the Atharvaveda, there are 79 works, collected as 72 distinctly named parisistas.\n\n\n=== Upaveda ===\nThe term upaveda (\"applied knowledge\") is used in traditional literature to designate the subjects of certain technical works. Lists of what subjects are included in this class differ among sources.\nThe Charanavyuha mentions four Upavedas:\n\nArchery (Dhanurveda), associated with the Yajurveda\nArchitecture (Sthapatyaveda), associated with the Rigveda.\nMusic and sacred dance (Gāndharvaveda), associated with the Samaveda\nMedicine (Āyurveda), associated with the Atharvaveda.\n\n\n=== \"Fifth\" and other Vedas ===\nSome post-Vedic texts, including the Mahabharata, the Natyasastra and certain Puranas, refer to themselves as the \"fifth Veda\". The earliest reference to such a \"fifth Veda\" is found in the Chandogya Upanishad in hymn 7.1.2.\n\nLet drama and dance (Nātya, नाट्य) be the fifth vedic scripture. Combined with an epic story, tending to virtue, wealth, joy and spiritual freedom, it must contain the significance of every scripture, and forward every art. Thus, from all the Vedas, Brahma framed the Nātya Veda. From the Rig Veda he drew forth the words, from the Sama Veda the melody, from the Yajur Veda gesture, and from the Atharva Veda the sentiment.\n\n\"Divya Prabandha\", for example Tiruvaymoli, is a term for canonical Tamil texts considered as Vernacular Veda by some South Indian Hindus.\nOther texts such as the Bhagavad Gita or the Vedanta Sutras are considered shruti or \"Vedic\" by some Hindu denominations but not universally within Hinduism. The Bhakti movement, and Gaudiya Vaishnavism in particular extended the term veda to include the Sanskrit Epics and Vaishnavite devotional texts such as the Pancharatra.\n\n\n=== Puranas ===\n\nThe Puranas is a vast genre of encyclopedic Indian literature about a wide range of topics particularly myths, legends and other traditional lore. Several of these texts are named after major Hindu deities such as Vishnu, Shiva and Devi. There are 18 Maha Puranas (Great Puranas) and 18 Upa Puranas (Minor Puranas), with over 400,000 verses.\nThe Puranas have been influential in the Hindu culture. They are considered Vaidika (congruent with Vedic literature). The Bhagavata Purana has been among the most celebrated and popular text in the Puranic genre, and is of non-dualistic tenor. The Puranic literature wove with the Bhakti movement in India, and both Dvaita and Advaita scholars have commented on the underlying Vedanta themes in the Maha Puranas.\n\n\n== Vedas in Sangam literature ==\nVedas finds its earliest literary mention in the Sangam literature dated to the 5th century BCE. The Vedas were read by almost every caste in ancient Tamil Nadu. An Indian historian, archaeologist and epigraphist named Ramachandran Nagaswamy mentions that Tamil Nadu was a land of Vedas and a place where everyone knew the Vedas. The Vedas are also considered as a text filled with deep meaning which can be understood only by scholars. The Purananuru mentions that the ancestors of Velir kings where born from the Sacred fire of a Northern sage and the Paṭṭiṉappālai mentions that the four Vedas were chanted by the priests of Ancient Tamilakam, this shows chanting of Vedas and growing sacred fires are part of the Tamil culture.\nVedas are called Maṛai or Vaymoli in parts of South India. Marai literally means \"hidden, a secret, mystery\". Perumpāṇāṟṟuppaṭai mentions a yupa post (a form of Vedic altar) in the Brahmin village. Vedas are recited by these Brahmins, and even their parrots are mentioned in the poem as those who sing the Vedic hymns. People in these Vedic villages did not eat meat, nor raise fowls. They ate rice, salad leaves boiled in ghee, pickles and vegetables. Apart from the Sanskrit Vedas there are other texts like Naalayira Divya Prabandham and Tevaram called as Tamil Veda and Dravida Veda.\n\n\n== Authority of the Vedas ==\nThe various Hindu sects and Indian philosophies have taken differing positions on the authority of the Vedas. Schools of Indian philosophy which acknowledge the authority of the Vedas are classified as \"orthodox\" (āstika). Other śramaṇa traditions, such as Charvaka, Ajivika, Buddhism and Jainism, which do not regard the Vedas as authorities, are referred to as \"heterodox\" or \"non-orthodox\" (nāstika) schools.\nCertain traditions which are often seen as being part of Hinduism also rejected the Vedas. For example, authors of the tantric Vaishnava Sahajiya tradition, like Siddha Mukundadeva, rejected the Vedas' authority. Likewise, some tantric Shaiva Agamas reject the Vedas. The Anandabhairava-tantra for example, states that \"the wise man should not elect as his authority the word of the Vedas, which is full of impurity, produces but scanty and transitory fruits and is limited.\"\nThough many religious Hindus implicitly acknowledge the authority of the Vedas, this acknowledgment is often \"no more than a declaration that someone considers himself [or herself] a Hindu\", and \"most Indians today pay lip service to the Veda and have no regard for the contents of the text.\" Some Hindus challenge the authority of the Vedas, thereby implicitly acknowledging its importance to the history of Hinduism, states Lipner.\nWhile Hindu reform movement such as Arya Samaj and Brahmo Samaj accept the authority of Vedas, Hindu modernists like Debendranath Tagore and Keshub Chandra Sen; and social reformers like B. R. Ambedkar reject its authority.\n\n\n== Western Indology ==\n\nThe study of Sanskrit in the West began in the 17th century. In the early 19th century, Arthur Schopenhauer drew attention to Vedic texts, specifically the Upanishads. The importance of Vedic Sanskrit for Indo-European studies was also recognized in the early 19th century. English translations of the Samhitas were published in the later 19th century, in the Sacred Books of the East series edited by Müller between 1879 and 1910. Ralph T. H. Griffith also presented English translations of the four Samhitas, published 1889 to 1899.\nRigveda manuscripts were selected for inscription in UNESCO's Memory of the World Register in 2007.\n\n\n== See also ==\n\nHindu philosophy\nHistorical Vedic religion\nPyramid Texts\nShakha\nVedic chant\nBrahminism\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n== Further reading ==\nOverviews\nGonda, J. (1975), Vedic Literature: Saṃhitās and Brāhmaṇas, vol. 1, Veda and Upanishads, Wiesnaden: Harrassowitz: A History of Indian literature, ISBN 978-3-447-01603-2.\nSantucci, J.A. (1976), \"An Outline of Vedic Literature\", Scholars Press for the American Academy of Religion.\nShrava, S. (1977), A Comprehensive History of Vedic Literature – Brahmana and Aranyaka Works, Pranava Prakashan.\nA Vedic Concordance, (an alphabetic index to every line, every stanza of the Vedas published before 1906), Harvard University: Maurice Bloomfield, 1906{{citation}}:  CS1 maint: others (link).\nThe Vedas at sacred-texts.com, Sacred Texts.\nConcordances\nBloomfield, M. (1907), A Vedic Concordance.\nBandhu, Vishva; Dev, Bhim (1963), Bhaskaran Nair, S. (ed.), Vaidika-Padānukrama-Koṣa: A Vedic Word-Concordance, Hoshiarpur: Vishveshvaranand Vedic Research Institute.\nAn Enlarged Electronic Version of Bloomfield's A Vedic Concordance, Harvard University Press.\nConference proceedings\nGriffiths, Arlo (2004), Houben, Jan E.M. (ed.), The Vedas : texts, language & ritual: proceedings of the Third International Vedic Workshop, Leiden 2002, Groningen : Forsten: Groningen Oriental Studies 20, ISBN 90-6980-149-3.\nMichael, Witzel, On the History and the Present State of Vedic Tradition in Nepal (PDF).\nJournals\nArnold, Edward Vernon (1897), \"Sketch of the Historical Grammar of the Rig and Atharva Vedas\", Journal of the American Oriental Society, 18: 203–353, doi:10.2307/592303, ISSN 0003-0279, JSTOR 592303.\n\n\n== External links ==\n\n\"GRETIL etexts\", Goettingen.",
    "url": "https://en.wikipedia.org/wiki/Vedas",
    "related_articles": [
      "Atharvaveda",
      "Vyasa",
      "Rigveda",
      "Yajurveda"
    ]
  },
  "timestamp": 1753176829.590749
}