{
  "subject": "mathematics",
  "topic": "triangle",
  "wikipedia": {
    "title": "Triangle",
    "summary": "A triangle is a polygon with three corners and three sides, one of the basic shapes in geometry. The corners, also called vertices, are zero-dimensional points while the sides connecting them, also called edges, are one-dimensional line segments. A triangle has three internal angles, each one bounded by a pair of adjacent edges; the sum of angles of a triangle always equals a straight angle (180 degrees or π radians). The triangle is a plane figure and its interior is a planar region. Sometimes an arbitrary edge is chosen to be the base, in which case the opposite vertex is called the apex; the shortest segment between the base and apex is the height. The area of a triangle equals one-half the product of height and base length.\n\nIn Euclidean geometry, any two points determine a unique line segment situated within a unique straight line, and any three points that do not all lie on the same straight line determine a unique triangle situated within a unique flat plane. More generally, four points in three-dimensional Euclidean space determine a solid figure called tetrahedron. \nIn non-Euclidean geometries, three \"straight\" segments (having zero curvature) also determine a \"triangle\", for instance, a spherical triangle or hyperbolic triangle. A geodesic triangle is a region of a general two-dimensional surface enclosed by three sides that are straight relative to the surface (geodesics). A curvilinear triangle is a shape with three curved sides, for instance, a circular triangle with circular-arc sides. (This article is about straight-sided triangles in Euclidean geometry, except where otherwise noted.)\nTriangles are classified into different types based on their angles and the lengths of their sides. Relations between angles and side lengths are a major focus of trigonometry. In particular, the sine, cosine, and tangent functions relate side lengths and angles in right triangles.\n\n",
    "content": "A triangle is a polygon with three corners and three sides, one of the basic shapes in geometry. The corners, also called vertices, are zero-dimensional points while the sides connecting them, also called edges, are one-dimensional line segments. A triangle has three internal angles, each one bounded by a pair of adjacent edges; the sum of angles of a triangle always equals a straight angle (180 degrees or π radians). The triangle is a plane figure and its interior is a planar region. Sometimes an arbitrary edge is chosen to be the base, in which case the opposite vertex is called the apex; the shortest segment between the base and apex is the height. The area of a triangle equals one-half the product of height and base length.\n\nIn Euclidean geometry, any two points determine a unique line segment situated within a unique straight line, and any three points that do not all lie on the same straight line determine a unique triangle situated within a unique flat plane. More generally, four points in three-dimensional Euclidean space determine a solid figure called tetrahedron. \nIn non-Euclidean geometries, three \"straight\" segments (having zero curvature) also determine a \"triangle\", for instance, a spherical triangle or hyperbolic triangle. A geodesic triangle is a region of a general two-dimensional surface enclosed by three sides that are straight relative to the surface (geodesics). A curvilinear triangle is a shape with three curved sides, for instance, a circular triangle with circular-arc sides. (This article is about straight-sided triangles in Euclidean geometry, except where otherwise noted.)\nTriangles are classified into different types based on their angles and the lengths of their sides. Relations between angles and side lengths are a major focus of trigonometry. In particular, the sine, cosine, and tangent functions relate side lengths and angles in right triangles.\n\n\n== Definition, terminology, and types ==\nA triangle is a figure consisting of three line segments, each of whose endpoints are connected. This forms a polygon with three sides and three angles. The terminology for categorizing triangles is more than two thousand years old, having been defined in Book One of Euclid's Elements. The names used for modern classification are either a direct transliteration of Euclid's Greek or their Latin translations.\nTriangles have many types based on the length of the sides and the angles. A triangle whose sides are all the same length is an equilateral triangle, a triangle with two sides having the same length is an isosceles triangle, and a triangle with three different-length sides is a scalene triangle. A triangle in which one of the angles is a right angle is a right triangle, a triangle in which all of its angles are less than that angle is an acute triangle, and a triangle in which one of it angles is greater than that angle is an obtuse triangle. These definitions date back at least to Euclid.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== Appearances ==\n\nAll types of triangles are commonly found in real life. In man-made construction, the isosceles triangles may be found in the shape of gables and pediments, and the equilateral triangle can be found in the yield sign. The faces of the Great Pyramid of Giza are sometimes considered to be equilateral, but more accurate measurements show they are isosceles instead. Other appearances are in heraldic symbols as in the flag of Saint Lucia and flag of the Philippines.\nTriangles also appear in three-dimensional objects. A polyhedron is a solid whose boundary is covered by flat polygonals known as the faces, sharp corners known as the vertices, and line segments known as the edges. Polyhedra in some cases can be classified, judging from the shape of their faces. For example, when polyhedra have all equilateral triangles as their faces, they are known as deltahedra. Antiprisms have alternating triangles on their sides. Pyramids and bipyramids are polyhedra with polygonal bases and triangles for lateral faces; the triangles are isosceles whenever they are right pyramids and bipyramids. The Kleetope of a polyhedron is a new polyhedron made by replacing each face of the original with a pyramid, and so the faces of a Kleetope will be triangles. More generally, triangles can be found in higher dimensions, as in the generalized notion of triangles known as the simplex, and the polytopes with triangular facets known as the simplicial polytopes.\n\n\n== Properties ==\n\n\n=== Points, lines, and circles associated with a triangle ===\n\nEach triangle has many special points inside it, on its edges, or otherwise associated with it. They are constructed by finding three lines associated symmetrically with the three sides (or vertices) and then proving that the three lines meet in a single point. An important tool for proving the existence of these points is Ceva's theorem, which gives a criterion for determining when three such lines are concurrent. Similarly, lines associated with a triangle are often constructed by proving that three symmetrically constructed points are collinear; here Menelaus' theorem gives a useful general criterion. In this section, just a few of the most commonly encountered constructions are explained.\nA perpendicular bisector of a side of a triangle is a straight line passing through the midpoint of the side and being perpendicular to it, forming a right angle with it. The three perpendicular bisectors meet in a single point, the triangle's circumcenter; this point is the center of the circumcircle, the circle passing through all three vertices. Thales' theorem implies that if the circumcenter is located on the side of the triangle, then the angle opposite that side is a right angle. If the circumcenter is located inside the triangle, then the triangle is acute; if the circumcenter is located outside the triangle, then the triangle is obtuse.\n\nAn altitude of a triangle is a straight line through a vertex and perpendicular to the opposite side. This opposite side is called the base of the altitude, and the point where the altitude intersects the base (or its extension) is called the foot of the altitude. The length of the altitude is the distance between the base and the vertex. The three altitudes intersect in a single point, called the orthocenter of the triangle. The orthocenter lies inside the triangle if and only if the triangle is acute.\n\nAn angle bisector of a triangle is a straight line through a vertex that cuts the corresponding angle in half. The three angle bisectors intersect in a single point, the incenter, which is the center of the triangle's incircle. The incircle is the circle that lies inside the triangle and touches all three sides. Its radius is called the inradius. There are three other important circles, the excircles; they lie outside the triangle and touch one side, as well as the extensions of the other two. The centers of the incircles and excircles form an orthocentric system. The midpoints of the three sides and the feet of the three altitudes all lie on a single circle, the triangle's nine-point circle. The remaining three points for which it is named are the midpoints of the portion of altitude between the vertices and the orthocenter. The radius of the nine-point circle is half that of the circumcircle. It touches the incircle (at the Feuerbach point) and the three excircles. The orthocenter (blue point), the center of the nine-point circle (red), the centroid (orange), and the circumcenter (green) all lie on a single line, known as Euler's line (red line). The center of the nine-point circle lies at the midpoint between the orthocenter and the circumcenter, and the distance between the centroid and the circumcenter is half that between the centroid and the orthocenter. Generally, the incircle's center is not located on Euler's line.\nA median of a triangle is a straight line through a vertex and the midpoint of the opposite side, and divides the triangle into two equal areas. The three medians intersect in a single point, the triangle's centroid or geometric barycenter. The centroid of a rigid triangular object (cut out of a thin sheet of uniform density) is also its center of mass: the object can be balanced on its centroid in a uniform gravitational field. The centroid cuts every median in the ratio 2:1, i.e. the distance between a vertex and the centroid is twice the distance between the centroid and the midpoint of the opposite side. If one reflects a median in the angle bisector that passes through the same vertex, one obtains a symmedian. The three symmedians intersect in a single point, the symmedian point of the triangle.\n\n\n=== Angles ===\n\nThe sum of the measures of the interior angles of a triangle in Euclidean space is always 180 degrees. This fact is equivalent to Euclid's parallel postulate. This allows the determination of the measure of the third angle of any triangle, given the measure of two angles. An exterior angle of a triangle is an angle that is a linear pair (and hence supplementary) to an interior angle. The measure of an exterior angle of a triangle is equal to the sum of the measures of the two interior angles that are not adjacent to it; this is the exterior angle theorem. The sum of the measures of the three exterior angles (one for each vertex) of any triangle is 360 degrees, and indeed, this is true for any convex polygon, no matter how many sides it has.\nAnother relation between the internal angles and triangles creates a new concept of trigonometric functions. The primary trigonometric functions are sine and cosine, as well as the other functions. They can be defined as the ratio between any two sides of a right triangle. In a scalene triangle, the trigonometric functions can be used to find the unknown measure of either a side or an internal angle; methods for doing so use the law of sines and the law of cosines.\nAny three angles that add to 180° can be the internal angles of a triangle. Infinitely many triangles have the same angles, since specifying the angles of a triangle does not determine its size. (A degenerate triangle, whose vertices are collinear, has internal angles of 0° and 180°; whether such a shape counts as a triangle is a matter of convention.) The conditions for three angles \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n, \n  \n    \n      \n        β\n      \n    \n    {\\displaystyle \\beta }\n  \n, and \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n, each of them between 0° and 180°, to be the angles of a triangle can also be stated using trigonometric functions. For example, a triangle with angles \n  \n    \n      \n        α\n      \n    \n    {\\displaystyle \\alpha }\n  \n, \n  \n    \n      \n        β\n      \n    \n    {\\displaystyle \\beta }\n  \n, and \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n exists if and only if\n\n  \n    \n      \n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        α\n        +\n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        β\n        +\n        \n          cos\n          \n            2\n          \n        \n        ⁡\n        γ\n        +\n        2\n        cos\n        ⁡\n        (\n        α\n        )\n        cos\n        ⁡\n        (\n        β\n        )\n        cos\n        ⁡\n        (\n        γ\n        )\n        =\n        1.\n      \n    \n    {\\displaystyle \\cos ^{2}\\alpha +\\cos ^{2}\\beta +\\cos ^{2}\\gamma +2\\cos(\\alpha )\\cos(\\beta )\\cos(\\gamma )=1.}\n  \n\n\n=== Similarity and congruence ===\n\nTwo triangles are said to be similar, if every angle of one triangle has the same measure as the corresponding angle in the other triangle. The corresponding sides of similar triangles have lengths that are in the same proportion, and this property is also sufficient to establish similarity.\nSome basic theorems about similar triangles are:\n\nIf and only if one pair of internal angles of two triangles have the same measure as each other, and another pair also have the same measure as each other, the triangles are similar.\nIf and only if one pair of corresponding sides of two triangles are in the same proportion as another pair of corresponding sides, and their included angles have the same measure, then the triangles are similar. (The included angle for any two sides of a polygon is the internal angle between those two sides.)\nIf and only if three pairs of corresponding sides of two triangles are all in the same proportion, then the triangles are similar.\nTwo triangles that are congruent have exactly the same size and shape. All pairs of congruent triangles are also similar, but not all pairs of similar triangles are congruent. Given two congruent triangles, all pairs of corresponding interior angles are equal in measure, and all pairs of corresponding sides have the same length. This is a total of six equalities, but three are often sufficient to prove congruence.\nSome individually necessary and sufficient conditions for a pair of triangles to be congruent are:\n\nSAS Postulate: Two sides in a triangle have the same length as two sides in the other triangle, and the included angles have the same measure.\nASA: Two interior angles and the side between them in a triangle have the same measure and length, respectively, as those in the other triangle. (This is the basis of surveying by triangulation.)\nSSS: Each side of a triangle has the same length as the corresponding side of the other triangle.\nAAS: Two angles and a corresponding (non-included) side in a triangle have the same measure and length, respectively, as those in the other triangle. (This is sometimes referred to as AAcorrS and then includes ASA above.)\n\n\n=== Area ===\n\nIn the Euclidean plane, area is defined by comparison with a square of side length ⁠\n  \n    \n      \n        1\n      \n    \n    {\\displaystyle 1}\n  \n⁠, which has area 1. There are several ways to calculate the area of an arbitrary triangle. One of the oldest and simplest is to take half the product of the length of one side ⁠\n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n  \n⁠ (the base) times the corresponding altitude ⁠\n  \n    \n      \n        h\n      \n    \n    {\\displaystyle h}\n  \n⁠:\n\n  \n    \n      \n        T\n        =\n        \n          \n            \n              1\n              2\n            \n          \n        \n        b\n        h\n        .\n      \n    \n    {\\displaystyle T={\\tfrac {1}{2}}bh.}\n  \n\nThis formula can be proven by cutting up the triangle and an identical copy into pieces and rearranging the pieces into the shape of a rectangle of base ⁠\n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n  \n⁠ and height ⁠\n  \n    \n      \n        h\n      \n    \n    {\\displaystyle h}\n  \n⁠.\n\nIf two sides ⁠\n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n⁠ and ⁠\n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n  \n⁠ and their included angle \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n are known, then the altitude can be calculated using trigonometry, ⁠\n  \n    \n      \n        h\n        =\n        a\n        sin\n        ⁡\n        (\n        γ\n        )\n      \n    \n    {\\displaystyle h=a\\sin(\\gamma )}\n  \n⁠, so the area of the triangle is:\n\n  \n    \n      \n        T\n        =\n        \n          \n            \n              1\n              2\n            \n          \n        \n        a\n        b\n        sin\n        ⁡\n        γ\n        .\n      \n    \n    {\\displaystyle T={\\tfrac {1}{2}}ab\\sin \\gamma .}\n  \n\nHeron's formula, named after Heron of Alexandria, is a formula for finding the area of a triangle from the lengths of its sides \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n, \n  \n    \n      \n        b\n      \n    \n    {\\displaystyle b}\n  \n, \n  \n    \n      \n        c\n      \n    \n    {\\displaystyle c}\n  \n. Letting \n  \n    \n      \n        s\n        =\n        \n          \n            \n              1\n              2\n            \n          \n        \n        (\n        a\n        +\n        b\n        +\n        c\n        )\n      \n    \n    {\\displaystyle s={\\tfrac {1}{2}}(a+b+c)}\n  \n be the  semiperimeter,\n\n  \n    \n      \n        T\n        =\n        \n          \n            s\n            (\n            s\n            −\n            a\n            )\n            (\n            s\n            −\n            b\n            )\n            (\n            s\n            −\n            c\n            )\n          \n        \n        .\n      \n    \n    {\\displaystyle T={\\sqrt {s(s-a)(s-b)(s-c)}}.}\n  \n\nBecause the ratios between areas of shapes in the same plane are preserved by affine transformations, the relative areas of triangles in any affine plane can be defined without reference to a notion of distance or squares. In any affine space (including Euclidean planes), every triangle with the same base and oriented area has its apex (the third vertex) on a line parallel to the base, and their common area is half of that of a parallelogram with the same base whose opposite side lies on the parallel line. This affine approach was developed in Book 1 of Euclid's Elements.\nGiven affine coordinates (such as Cartesian coordinates) ⁠\n  \n    \n      \n        (\n        \n          x\n          \n            A\n          \n        \n        ,\n        \n          y\n          \n            A\n          \n        \n        )\n      \n    \n    {\\displaystyle (x_{A},y_{A})}\n  \n⁠, ⁠\n  \n    \n      \n        (\n        \n          x\n          \n            B\n          \n        \n        ,\n        \n          y\n          \n            B\n          \n        \n        )\n      \n    \n    {\\displaystyle (x_{B},y_{B})}\n  \n⁠, ⁠\n  \n    \n      \n        (\n        \n          x\n          \n            C\n          \n        \n        ,\n        \n          y\n          \n            C\n          \n        \n        )\n      \n    \n    {\\displaystyle (x_{C},y_{C})}\n  \n⁠ for the vertices of a triangle, its relative oriented area can be calculated using the shoelace formula,\n\n  \n    \n      \n        \n          \n            \n              \n                T\n              \n              \n                \n                =\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  \n                    |\n                    \n                      \n                        \n                          \n                            x\n                            \n                              A\n                            \n                          \n                        \n                        \n                          \n                            x\n                            \n                              B\n                            \n                          \n                        \n                        \n                          \n                            x\n                            \n                              C\n                            \n                          \n                        \n                      \n                      \n                        \n                          \n                            y\n                            \n                              A\n                            \n                          \n                        \n                        \n                          \n                            y\n                            \n                              B\n                            \n                          \n                        \n                        \n                          \n                            y\n                            \n                              C\n                            \n                          \n                        \n                      \n                      \n                        \n                          1\n                        \n                        \n                          1\n                        \n                        \n                          1\n                        \n                      \n                    \n                    |\n                  \n                \n                =\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  \n                    |\n                    \n                      \n                        \n                          \n                            x\n                            \n                              A\n                            \n                          \n                        \n                        \n                          \n                            x\n                            \n                              B\n                            \n                          \n                        \n                      \n                      \n                        \n                          \n                            y\n                            \n                              A\n                            \n                          \n                        \n                        \n                          \n                            y\n                            \n                              B\n                            \n                          \n                        \n                      \n                    \n                    |\n                  \n                \n                +\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  \n                    |\n                    \n                      \n                        \n                          \n                            x\n                            \n                              B\n                            \n                          \n                        \n                        \n                          \n                            x\n                            \n                              C\n                            \n                          \n                        \n                      \n                      \n                        \n                          \n                            y\n                            \n                              B\n                            \n                          \n                        \n                        \n                          \n                            y\n                            \n                              C\n                            \n                          \n                        \n                      \n                    \n                    |\n                  \n                \n                +\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                \n                  \n                    |\n                    \n                      \n                        \n                          \n                            x\n                            \n                              C\n                            \n                          \n                        \n                        \n                          \n                            x\n                            \n                              A\n                            \n                          \n                        \n                      \n                      \n                        \n                          \n                            y\n                            \n                              C\n                            \n                          \n                        \n                        \n                          \n                            y\n                            \n                              A\n                            \n                          \n                        \n                      \n                    \n                    |\n                  \n                \n              \n            \n            \n              \n              \n                \n                =\n                \n                  \n                    \n                      1\n                      2\n                    \n                  \n                \n                (\n                \n                  x\n                  \n                    A\n                  \n                \n                \n                  y\n                  \n                    B\n                  \n                \n                −\n                \n                  x\n                  \n                    B\n                  \n                \n                \n                  y\n                  \n                    A\n                  \n                \n                +\n                \n                  x\n                  \n                    B\n                  \n                \n                \n                  y\n                  \n                    C\n                  \n                \n                −\n                \n                  x\n                  \n                    C\n                  \n                \n                \n                  y\n                  \n                    B\n                  \n                \n                +\n                \n                  x\n                  \n                    C\n                  \n                \n                \n                  y\n                  \n                    A\n                  \n                \n                −\n                \n                  x\n                  \n                    A\n                  \n                \n                \n                  y\n                  \n                    C\n                  \n                \n                )\n                ,\n              \n            \n          \n        \n      \n    \n    {\\displaystyle {\\begin{aligned}T&={\\tfrac {1}{2}}{\\begin{vmatrix}x_{A}&x_{B}&x_{C}\\\\y_{A}&y_{B}&y_{C}\\\\1&1&1\\end{vmatrix}}={\\tfrac {1}{2}}{\\begin{vmatrix}x_{A}&x_{B}\\\\y_{A}&y_{B}\\end{vmatrix}}+{\\tfrac {1}{2}}{\\begin{vmatrix}x_{B}&x_{C}\\\\y_{B}&y_{C}\\end{vmatrix}}+{\\tfrac {1}{2}}{\\begin{vmatrix}x_{C}&x_{A}\\\\y_{C}&y_{A}\\end{vmatrix}}\\\\&={\\tfrac {1}{2}}(x_{A}y_{B}-x_{B}y_{A}+x_{B}y_{C}-x_{C}y_{B}+x_{C}y_{A}-x_{A}y_{C}),\\end{aligned}}}\n  \n\nwhere \n  \n    \n      \n        \n          |\n        \n        ⋅\n        \n          |\n        \n      \n    \n    {\\displaystyle |\\cdot |}\n  \n is the matrix determinant.\n\n\n=== Possible side lengths ===\n\nThe triangle inequality states that the sum of the lengths of any two sides of a triangle must be greater than or equal to the length of the third side. Conversely, some triangle with three given positive side lengths exists if and only if those side lengths satisfy the triangle inequality. The sum of two side lengths can equal the length of the third side only in the case of a degenerate triangle, one with collinear vertices.\n\n\n=== Rigidity ===\n\nUnlike a rectangle, which may collapse into a parallelogram from pressure to one of its points, triangles are sturdy because specifying the lengths of all three sides determines the angles. Therefore, a triangle will not change shape unless its sides are bent or extended or broken or if its joints break; in essence, each of the three sides supports the other two. A rectangle, in contrast, is more dependent on the strength of its joints in a structural sense.\nTriangles are strong in terms of rigidity, but while packed in a tessellating arrangement triangles are not as strong as hexagons under compression (hence the prevalence of hexagonal forms in nature). Tessellated triangles still maintain superior strength for cantilevering, however, which is why engineering makes use of tetrahedral trusses.\n\n\n=== Triangulation ===\n\nTriangulation means the partition of any planar object into a collection of triangles. For example, in polygon triangulation, a polygon is subdivided into multiple triangles that are attached edge-to-edge, with the property that their vertices coincide with the set of vertices of the polygon. In the case of a simple polygon with \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n sides, there are \n  \n    \n      \n        n\n        −\n        2\n      \n    \n    {\\displaystyle n-2}\n  \n triangles that are separated by \n  \n    \n      \n        n\n        −\n        3\n      \n    \n    {\\displaystyle n-3}\n  \n diagonals. Triangulation of a simple polygon has a relationship to the ear, a vertex connected by two other vertices, the diagonal between which lies entirely within the polygon. The two ears theorem states that every simple polygon that is not itself a triangle has at least two ears.\n\n\n== Location of a point ==\nOne way to identify locations of points in (or outside) a triangle is to place the triangle in an arbitrary location and orientation in the Cartesian plane, and to use Cartesian coordinates. While convenient for many purposes, this approach has the disadvantage of all points' coordinate values being dependent on the arbitrary placement in the plane.\nTwo systems avoid that feature, so that the coordinates of a point are not affected by moving the triangle, rotating it, or reflecting it as in a mirror, any of which gives a congruent triangle, or even by rescaling it to a similar triangle:\n\nTrilinear coordinates specify the relative distances of a point from the sides, so that coordinates \n  \n    \n      \n        x\n        :\n        y\n        :\n        z\n      \n    \n    {\\displaystyle x:y:z}\n  \n indicate that the ratio of the distance of the point from the first side to its distance from the second side is \n  \n    \n      \n        x\n        :\n        y\n      \n    \n    {\\displaystyle x:y}\n  \n, etc.\nBarycentric coordinates of the form \n  \n    \n      \n        α\n        :\n        β\n        :\n        γ\n      \n    \n    {\\displaystyle \\alpha :\\beta :\\gamma }\n  \n specify the point's location by the relative weights that would have to be put on the three vertices in order to balance the otherwise weightless triangle on the given point.\n\n\n== Related figures ==\n\n\n=== Figures inscribed in a triangle ===\nAs discussed above, every triangle has a unique inscribed circle (incircle) that is interior to the triangle and tangent to all three sides. Every triangle has a unique Steiner inellipse which is interior to the triangle and tangent at the midpoints of the sides. Marden's theorem shows how to find the foci of this ellipse. This ellipse has the greatest area of any ellipse tangent to all three sides of the triangle. The Mandart inellipse of a triangle is the ellipse inscribed within the triangle tangent to its sides at the contact points of its excircles. For any ellipse inscribed in a triangle \n  \n    \n      \n        A\n        B\n        C\n      \n    \n    {\\displaystyle ABC}\n  \n, let the foci be \n  \n    \n      \n        P\n      \n    \n    {\\displaystyle P}\n  \n and \n  \n    \n      \n        Q\n      \n    \n    {\\displaystyle Q}\n  \n, then:\n\n  \n    \n      \n        \n          \n            \n              \n                \n                  \n                    P\n                    A\n                  \n                  ¯\n                \n              \n              ⋅\n              \n                \n                  \n                    Q\n                    A\n                  \n                  ¯\n                \n              \n            \n            \n              \n                \n                  \n                    C\n                    A\n                  \n                  ¯\n                \n              \n              ⋅\n              \n                \n                  \n                    A\n                    B\n                  \n                  ¯\n                \n              \n            \n          \n        \n        +\n        \n          \n            \n              \n                \n                  \n                    P\n                    B\n                  \n                  ¯\n                \n              \n              ⋅\n              \n                \n                  \n                    Q\n                    B\n                  \n                  ¯\n                \n              \n            \n            \n              \n                \n                  \n                    A\n                    B\n                  \n                  ¯\n                \n              \n              ⋅\n              \n                \n                  \n                    B\n                    C\n                  \n                  ¯\n                \n              \n            \n          \n        \n        +\n        \n          \n            \n              \n                \n                  \n                    P\n                    C\n                  \n                  ¯\n                \n              \n              ⋅\n              \n                \n                  \n                    Q\n                    C\n                  \n                  ¯\n                \n              \n            \n            \n              \n                \n                  \n                    B\n                    C\n                  \n                  ¯\n                \n              \n              ⋅\n              \n                \n                  \n                    C\n                    A\n                  \n                  ¯\n                \n              \n            \n          \n        \n        =\n        1.\n      \n    \n    {\\displaystyle {\\frac {{\\overline {PA}}\\cdot {\\overline {QA}}}{{\\overline {CA}}\\cdot {\\overline {AB}}}}+{\\frac {{\\overline {PB}}\\cdot {\\overline {QB}}}{{\\overline {AB}}\\cdot {\\overline {BC}}}}+{\\frac {{\\overline {PC}}\\cdot {\\overline {QC}}}{{\\overline {BC}}\\cdot {\\overline {CA}}}}=1.}\n  \n\nFrom an interior point in a reference triangle, the nearest points on the three sides serve as the vertices of the pedal triangle of that point. If the interior point is the circumcenter of the reference triangle, the vertices of the pedal triangle are the midpoints of the reference triangle's sides, and so the pedal triangle is called the midpoint triangle or medial triangle. The midpoint triangle subdivides the reference triangle into four congruent triangles which are similar to the reference triangle.\nThe intouch triangle of a reference triangle has its vertices at the three points of tangency of the reference triangle's sides with its incircle. The extouch triangle of a reference triangle has its vertices at the points of tangency of the reference triangle's excircles with its sides (not extended).\n\nThe inscribed squares tangent their vertices to the triangle's sides is the special case of inscribed square problem, although the problem asking for a square whose vertices lie on a simple closed curve. A notable example of this figure relation is the Calabi triangle in which the vertices of every three squares are tangent to all obtuse triangle's sides. Every acute triangle has three inscribed squares (squares in its interior such that all four of a square's vertices lie on a side of the triangle, so two of them lie on the same side and hence one side of the square coincides with part of a side of the triangle). In a right triangle, two of the squares coincide and have a vertex at the triangle's right angle, so a right triangle has only two distinct inscribed squares. An obtuse triangle has only one inscribed square, with a side coinciding with part of the triangle's longest side.  Within a given triangle, a longer common side is associated with a smaller inscribed square. If an inscribed square has a side of length \n  \n    \n      \n        \n          q\n          \n            a\n          \n        \n      \n    \n    {\\displaystyle q_{a}}\n  \n and the triangle has a side of length \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n, part of which side coincides with a side of the square, then \n  \n    \n      \n        \n          q\n          \n            a\n          \n        \n      \n    \n    {\\displaystyle q_{a}}\n  \n, \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n, \n  \n    \n      \n        \n          h\n          \n            a\n          \n        \n      \n    \n    {\\displaystyle h_{a}}\n  \n from the side \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n, and the triangle's area \n  \n    \n      \n        T\n      \n    \n    {\\displaystyle T}\n  \n are related according to\n  \n    \n      \n        \n          q\n          \n            a\n          \n        \n        =\n        \n          \n            \n              2\n              T\n              a\n            \n            \n              \n                a\n                \n                  2\n                \n              \n              +\n              2\n              T\n            \n          \n        \n        =\n        \n          \n            \n              a\n              \n                h\n                \n                  a\n                \n              \n            \n            \n              a\n              +\n              \n                h\n                \n                  a\n                \n              \n            \n          \n        \n        .\n      \n    \n    {\\displaystyle q_{a}={\\frac {2Ta}{a^{2}+2T}}={\\frac {ah_{a}}{a+h_{a}}}.}\n  \nThe largest possible ratio of the area of the inscribed square to the area of the triangle is 1/2, which occurs when \n  \n    \n      \n        \n          a\n          \n            2\n          \n        \n        =\n        2\n        T\n      \n    \n    {\\displaystyle a^{2}=2T}\n  \n, \n  \n    \n      \n        q\n        =\n        a\n        \n          /\n        \n        2\n      \n    \n    {\\displaystyle q=a/2}\n  \n, and the altitude of the triangle from the base of length \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n is equal to \n  \n    \n      \n        a\n      \n    \n    {\\displaystyle a}\n  \n. The smallest possible ratio of the side of one inscribed square to the side of another in the same non-obtuse triangle is \n  \n    \n      \n        2\n        \n          \n            2\n          \n        \n        \n          /\n        \n        3\n      \n    \n    {\\displaystyle 2{\\sqrt {2}}/3}\n  \n. Both of these extreme cases occur for the isosceles right triangle.\n\nThe Lemoine hexagon is a cyclic hexagon with vertices given by the six intersections of the sides of a triangle with the three lines that are parallel to the sides and that pass through its symmedian point. In either its simple form or its self-intersecting form, the Lemoine hexagon is interior to the triangle with two vertices on each side of the triangle.\nEvery convex polygon with area \n  \n    \n      \n        T\n      \n    \n    {\\displaystyle T}\n  \n can be inscribed in a triangle of area at most equal to \n  \n    \n      \n        2\n        T\n      \n    \n    {\\displaystyle 2T}\n  \n. Equality holds only if the polygon is a parallelogram.\n\n\n=== Figures circumscribed about a triangle ===\n\nThe tangential triangle of a reference triangle (other than a right triangle) is the triangle whose sides are on the tangent lines to the reference triangle's circumcircle at its vertices.\nAs mentioned above, every triangle has a unique circumcircle, a circle passing through all three vertices, whose center is the intersection of the perpendicular bisectors of the triangle's sides. Furthermore, every triangle has a unique Steiner circumellipse, which passes through the triangle's vertices and has its center at the triangle's centroid. Of all ellipses going through the triangle's vertices, it has the smallest area.\nThe Kiepert hyperbola is unique conic that passes through the triangle's three vertices, its centroid, and its circumcenter.\nOf all triangles contained in a given convex polygon, one with maximal area can be found in linear time; its vertices may be chosen as three of the vertices of the given polygon.\n\n\n== Miscellaneous triangles ==\n\n\n=== Circular triangles ===\n\nA circular triangle is a triangle with circular arc edges. The edges of a circular triangle may be either convex (bending outward) or concave (bending inward). The intersection of three disks forms a circular triangle whose sides are all convex. An example of a circular triangle with three convex edges is a Reuleaux triangle, which can be made by intersecting three circles of equal size. The construction may be performed with a compass alone without needing a straightedge, by the Mohr–Mascheroni theorem. Alternatively, it can be constructed by rounding the sides of an equilateral triangle.\nA special case of concave circular triangle can be seen in a pseudotriangle. A pseudotriangle is a simply-connected subset of the plane lying between three mutually tangent convex regions. These sides are three smoothed curved lines connecting their endpoints called the cusp points. Any pseudotriangle can be partitioned into many pseudotriangles with the boundaries of convex disks and bitangent lines, a process known as pseudo-triangulation. For \n  \n    \n      \n        n\n      \n    \n    {\\displaystyle n}\n  \n disks in a pseudotriangle, the partition gives \n  \n    \n      \n        2\n        n\n        −\n        2\n      \n    \n    {\\displaystyle 2n-2}\n  \n pseudotriangles and \n  \n    \n      \n        3\n        n\n        −\n        3\n      \n    \n    {\\displaystyle 3n-3}\n  \n bitangent lines. The convex hull of any pseudotriangle is a triangle.\n\n\n=== Triangle in non-planar space ===\n\nA non-planar triangle is a triangle not embedded in a Euclidean space, roughly speaking a flat space. This means triangles may also be discovered in several spaces, as in hyperbolic space and spherical geometry. A triangle in hyperbolic space is called a hyperbolic triangle, and it can be obtained by drawing on a negatively curved surface, such as a saddle surface. Likewise, a triangle in spherical geometry is called a spherical triangle, and it can be obtained by drawing on a positively curved surface such as a sphere.\nThe triangles in both spaces have properties different from the triangles in Euclidean space. For example, as mentioned above, the internal angles of a triangle in Euclidean space always add up to 180°. However, the sum of the internal angles of a hyperbolic triangle is less than 180°, and for any spherical triangle, the sum is more than 180°. In particular, it is possible to draw a triangle on a sphere such that the measure of each of its internal angles equals 90°, adding up to a total of 270°. By Girard's theorem, the sum of the angles of a triangle on a sphere is \n  \n    \n      \n        \n          180\n          \n            ∘\n          \n        \n        ×\n        (\n        1\n        +\n        4\n        f\n        )\n      \n    \n    {\\displaystyle 180^{\\circ }\\times (1+4f)}\n  \n, where \n  \n    \n      \n        f\n      \n    \n    {\\displaystyle f}\n  \n is the fraction of the sphere's area enclosed by the triangle.\nIn more general spaces, there are comparison theorems relating the properties of a triangle in the space to properties of a corresponding triangle in a model space like hyperbolic or elliptic space. For example, a CAT(k) space is characterized by such comparisons.\n\n\n=== Fractal geometry ===\nFractal shapes based on triangles include the Sierpiński gasket and the Koch snowflake.\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Footnotes ===\n\n\n=== Works cited ===\n\n\n== External links ==\n\nIvanov, A.B. (2001) [1994]. \"Triangle\". Encyclopedia of Mathematics. EMS Press.\nClark Kimberling: Encyclopedia of triangle centers. Lists some 5200 interesting points associated with any triangle.",
    "url": "https://en.wikipedia.org/wiki/Triangle",
    "related_articles": [
      "Isosceles triangle",
      "Golden triangle (mathematics)",
      "Equilateral triangle",
      "Pascal's triangle"
    ]
  },
  "timestamp": 1751689224.8645222
}