{
  "subject": "math",
  "topic": "triangle geometry",
  "wikipedia": {
    "title": "Modern triangle geometry",
    "summary": "In mathematics, modern triangle geometry, or new triangle geometry, is the body of knowledge relating to the properties of a triangle discovered and developed roughly since the beginning of the last quarter of the nineteenth century. Triangles and their properties were the subject of investigation since at least the time of Euclid. In fact, Euclid's Elements contains description of the four special points – centroid, incenter, circumcenter and orthocenter - associated with a triangle. Even though Pascal and Ceva in the seventeenth century, Euler in the eighteenth century and Feuerbach in the nineteenth century and many other mathematicians had made important discoveries regarding the properties of the triangle, it was the publication in 1873 of a paper by Emile Lemoine (1840–1912)  with the title \"On a remarkable point of the triangle\" that was considered to have, according to Nathan Altschiller-Court, \"laid the foundations...of the modern geometry of the triangle as a whole.\" The American Mathematical Monthly, in which much of Lemoine's work is published, declared that \"To none of these [geometers] more than Émile-Michel-Hyacinthe Lemoine is due the honor of starting this movement of modern triangle geometry\". The publication of this paper caused a remarkable upsurge of interest in investigating the properties of the triangle during the last quarter of the nineteenth century and the early years of the twentieth century. A hundred-page article on triangle geometry in Klein's Encyclopedia of Mathematical Sciences published in 1914 bears witness to this upsurge of interest in triangle geometry.\nIn the early days, the expression \"new triangle geometry\" referred to only the set of interesting objects associated with a triangle like the Lemoine point, Lemoine circle, Brocard circle and the Lemoine line. Later the theory of correspondences which was an offshoot of the theory of geometric transformations was developed to give coherence to the various isolated results. With its development, the expression \"new triangle geometry\" indicated not only the many remarkable objects associated with a triangle but also the methods used to study and classify these objects. Here is a definition of triangle geometry from 1887: \"Being given a point M in the plane of the triangle, we can always find, in an infinity of manners, a second point M' that corresponds to the first one according to an imagined geometrical law; these two points have between them geometrical relations whose simplicity depends on the more or less the lucky choice of the law which unites them and each geometrical law gives rise to a method of transformation a mode of conjugation which it remains to study.\" (See the conference paper titled \"Teaching new geometrical methods with an ancient figure in the nineteenth and twentieth centuries: the new triangle geometry in textbooks in Europe and USA (1888–1952)\" by Pauline Romera-Lebret presented in 2009.)\nHowever, this escalation of interest soon collapsed and triangle geometry was completely neglected until the closing years of the twentieth century. In his \"Development of Mathematics\", Eric Temple Bell offers his judgement on the status of modern triangle geometry in 1940 thus: \"The geometers of the 20th Century have long since piously removed all these treasures to the museum of geometry where the dust of history quickly dimmed their luster.\" (The Development of Mathematics, p. 323) Philip Davis has suggested several reasons for the decline of interest in triangle geometry. These include:\n\nThe feeling that the subject is elementary and of low professional status.\nThe exhaustion of its methodologic possibilities.\nThe visual complexity of the so-called deeper results of the subject.\nThe downgrading of the visual in favor of the algebraic.\nA dearth of connections to other fields.\nCompetition with other topics with a strong visual content like tessellations, fractals, graph theory, etc.\nA further revival of interest was witnessed with the advent of the modern electronic computer. The triangle geometry has again become an active area of research pursued by a group of dedicated geometers. As epitomizing this revival, one can point out the formulation of the concept of a \"triangle centre\" and the compilation by Clark Kimberling of an encyclopedia of triangle centers containing a listing of nearly 50,000 triangle centers and their properties and also the compilation of a catalogue of triangle cubics with detailed descriptions of several properties of more than 1200 triangle cubics. The open access journal Forum Geometricorum founded by Paul Yiu of Florida Atlantic University in 2001 also provided a tremendous impetus in furthering this new found enthusiasm for triangle geometry. Unfortunately, since 2019, the journal is not accepting submissions although back issues are still available online.\n\n",
    "content": "In mathematics, modern triangle geometry, or new triangle geometry, is the body of knowledge relating to the properties of a triangle discovered and developed roughly since the beginning of the last quarter of the nineteenth century. Triangles and their properties were the subject of investigation since at least the time of Euclid. In fact, Euclid's Elements contains description of the four special points – centroid, incenter, circumcenter and orthocenter - associated with a triangle. Even though Pascal and Ceva in the seventeenth century, Euler in the eighteenth century and Feuerbach in the nineteenth century and many other mathematicians had made important discoveries regarding the properties of the triangle, it was the publication in 1873 of a paper by Emile Lemoine (1840–1912)  with the title \"On a remarkable point of the triangle\" that was considered to have, according to Nathan Altschiller-Court, \"laid the foundations...of the modern geometry of the triangle as a whole.\" The American Mathematical Monthly, in which much of Lemoine's work is published, declared that \"To none of these [geometers] more than Émile-Michel-Hyacinthe Lemoine is due the honor of starting this movement of modern triangle geometry\". The publication of this paper caused a remarkable upsurge of interest in investigating the properties of the triangle during the last quarter of the nineteenth century and the early years of the twentieth century. A hundred-page article on triangle geometry in Klein's Encyclopedia of Mathematical Sciences published in 1914 bears witness to this upsurge of interest in triangle geometry.\nIn the early days, the expression \"new triangle geometry\" referred to only the set of interesting objects associated with a triangle like the Lemoine point, Lemoine circle, Brocard circle and the Lemoine line. Later the theory of correspondences which was an offshoot of the theory of geometric transformations was developed to give coherence to the various isolated results. With its development, the expression \"new triangle geometry\" indicated not only the many remarkable objects associated with a triangle but also the methods used to study and classify these objects. Here is a definition of triangle geometry from 1887: \"Being given a point M in the plane of the triangle, we can always find, in an infinity of manners, a second point M' that corresponds to the first one according to an imagined geometrical law; these two points have between them geometrical relations whose simplicity depends on the more or less the lucky choice of the law which unites them and each geometrical law gives rise to a method of transformation a mode of conjugation which it remains to study.\" (See the conference paper titled \"Teaching new geometrical methods with an ancient figure in the nineteenth and twentieth centuries: the new triangle geometry in textbooks in Europe and USA (1888–1952)\" by Pauline Romera-Lebret presented in 2009.)\nHowever, this escalation of interest soon collapsed and triangle geometry was completely neglected until the closing years of the twentieth century. In his \"Development of Mathematics\", Eric Temple Bell offers his judgement on the status of modern triangle geometry in 1940 thus: \"The geometers of the 20th Century have long since piously removed all these treasures to the museum of geometry where the dust of history quickly dimmed their luster.\" (The Development of Mathematics, p. 323) Philip Davis has suggested several reasons for the decline of interest in triangle geometry. These include:\n\nThe feeling that the subject is elementary and of low professional status.\nThe exhaustion of its methodologic possibilities.\nThe visual complexity of the so-called deeper results of the subject.\nThe downgrading of the visual in favor of the algebraic.\nA dearth of connections to other fields.\nCompetition with other topics with a strong visual content like tessellations, fractals, graph theory, etc.\nA further revival of interest was witnessed with the advent of the modern electronic computer. The triangle geometry has again become an active area of research pursued by a group of dedicated geometers. As epitomizing this revival, one can point out the formulation of the concept of a \"triangle centre\" and the compilation by Clark Kimberling of an encyclopedia of triangle centers containing a listing of nearly 50,000 triangle centers and their properties and also the compilation of a catalogue of triangle cubics with detailed descriptions of several properties of more than 1200 triangle cubics. The open access journal Forum Geometricorum founded by Paul Yiu of Florida Atlantic University in 2001 also provided a tremendous impetus in furthering this new found enthusiasm for triangle geometry. Unfortunately, since 2019, the journal is not accepting submissions although back issues are still available online.\n\n\n== The Lemoine geometry ==\n\n\n=== Lemoine point ===\nFor a given triangle ABC with centroid G, the symmedian through the vertex is the reflection of the line AG in the bisector of the angle A. There are three symmedians for a triangle one passing through each vertex. The three symmedians are concurrent and the point of concurrency, commonly denoted by K, is called the Lemoine point or the symmedian point or the Grebe point of triangle ABC. If the sidelengths of triangle ABC are a, b, c the baricentric coordinates of the Lemoine point are a2 : b2 : c2. It has been described as \"one of the crown jewels of modern geometry\". There are several earlier references to this point in the mathematical literature details of which are available in John Mackay'  history of the symmedian point.\nIn fact, the concurrency of the symmedians is a special case of a more general result: For any point P in the plane of triangle ABC, the isogonals of the lines AP, BP, CP are concurrent, the isogonal of AP (respectively BP, CP) being the reflection of the line AP in the bisector of the angle A (respectively B, C). The point of concurrency is called the isogonal conjugate of P. In this terminology, the Lemoine point is the isogonal conjugate of the centroid.\n\n\n=== Lemoine circles ===\nThe points of intersections of the lines through the Lemoine point of a triangle ABC parallel to the sides of the triangle lie on a circle called the first Lemoine circle of triangle ABC. The center of the first Lemoine circle lies midway between the circumcenter and the lemoine point of the triangle,\nThe points of intersections of the antiparallels to the sides of triangle ABC through the Lemoine point of a triangle ABC lie on a circle called the second Lemoine circle or the cosine circle of triangle ABC. The name \"cosine circle\" is due to the property of the second Lemoine circle that the lengths of the segments intercepted by the circle on the sides of the triangle proportional to the cosines of the angles opposite to the sides. The center of the second Lemoine circle is the Lemoine point.\n\n\n=== Lemoine axis ===\nAny triangle ABC and its tangential triangle are in perspective and the axis of perspectivity is called the Lemoine axis of triangle ABC.  It is the trilinear polar of the symmedian point of triangle ABC and also the polar of K with regard to the circumcircle of triangle ABC.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== Early modern triangle geometry ==\nA quick glance into the world of modern triangle geometry as it existed during the peak of interest in triangle geometry subsequent to the publication of Lemoine's paper is presented below. This presentation is largely based on the topics discussed in William Gallatly's book published in 1910 and Roger A Johnsons' book first published in 1929.\n\n\n=== Poristic triangles ===\nTwo triangles are said to be poristic triangles if they have the same incircle and circumcircle. Given a circle with Center O and radius R and another circle with center I and radius r, there are an infinite number of triangles ABC with Circle O(R) as circumcircle and I(r) as incircle if and only if OI2 = R2 − 2Rr . These triangles form a poristic system of triangles. The loci of certain special points like the centroid as the reference triangle traces the different triangles poristic with it turn out to often be circles and points.\n\n\n=== The Simson line ===\nFor any point P on the circumcircle of triangle ABC, the feet of perpendiculars from P to the sides of triangle ABC are collinear and the line of collinearity is the well-known Simson line of P.\n\n\n=== Pedal and antipedal triangles ===\nGiven a point P, let the feet of perpendiculars from P to the sides of the triangle ABC be D, E, F. The triangle DEF is called the pedal triangle of P. The antipedal triangle of P is the triangle formed by the lines through A, B, C perpendicular to PA, PB, PC respectively. Two points P and Q are called counter points if the pedal triangle  of P is homothetic to the antipedal triangle of Q and the pedal triangle of Q is homothetic to the antipedal triangle of P.\n\n\n=== The orthopole ===\nGiven any line l, let P, Q, R be the feet of perpendiculars from the vertices A, B, C of triangle ABC to l. The lines through P. Q, R perpendicular respectively to the sides BC, CA, AB are concurrent and the point of concurrence is the orthopole of the line l with respect to the triangle ABC. In modern triangle geometry, there is a large body of literature dealing with properties of orthopoles.\n\n\n=== The Brocard points ===\nLet of circles be described on the sides BC, CA, AB of triangle ABC whose external segments contain the two triads of angles C, A, B and B, C, A respectively. Each triad of circles determined by a triad of angles intersect at a common point thus yielding two such points. These points are called the Brocard points of triangle ABC and are usually denoted by \n  \n    \n      \n        Ω\n        ,\n        \n          Ω\n          \n            ′\n          \n        \n      \n    \n    {\\displaystyle \\Omega ,\\Omega ^{\\prime }}\n  \n. If P is the first Brocard point (which is the Brocard point determined by the first triad of circles) then the angles PBC, PCA and PAB are equal to each other and the common angle is called the Brocard angle of triangle ABC and is commonly denoted by \n  \n    \n      \n        ω\n      \n    \n    {\\displaystyle \\omega }\n  \n The Brocard angle is given by\n\n  \n    \n      \n        cot\n        ⁡\n        ω\n        =\n        cot\n        ⁡\n        A\n        +\n        cot\n        ⁡\n        B\n        +\n        cot\n        ⁡\n        C\n        .\n      \n    \n    {\\displaystyle \\cot \\omega =\\cot A+\\cot B+\\cot C.}\n  \n\nThe Brocard points and the Brocard angles have several interesting properties.\n\n\n=== Some images ===\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== Contemporary modern triangle geometry ==\n\n\n=== Triangle center ===\nOne of the most significant ideas that has emerged during the revival of interest in triangle geometry during the closing years of twentieth century is the notion of triangle center. This concept introduced by Clark Kimberling in 1994 unified in one notion the very many special and remarkable points associated with a triangle. Since the introduction of this idea, nearly no discussion on any result associated with a triangle is complete without a discussion on how the result connects with the triangle centers.\n\n\n==== Definition of triangle center ====\nA real-valued function f of three real variables a, b, c may have the following properties:\n\nHomogeneity: f(ta,tb,tc) = tn f(a,b,c) for some constant n and for all t > 0.\nBisymmetry in the second and third variables: f(a,b,c) = f(a,c,b).\nIf a non-zero f has both these properties it is called a triangle center function. If f is a triangle center function and a, b, c are the side-lengths of a reference triangle then the point whose trilinear coordinates are f(a,b,c) : f(b,c,a) : f(c,a,b) is called a triangle center.\nClark Kimberling is maintaining a website devoted to a compendium of triangle centers. The website named Encyclopedia of Triangle Centers has definitions and descriptions of nearly 50,000 triangle centers.\n\n\n=== Central line ===\nAnother unifying notion of contemporary modern triangle geometry is that of a central line. This concept unifies the several special straight lines associated with a triangle. The notion of a central line is also related to the notion of a triangle center.\n\n\n==== Definition of central line ====\nLet ABC be a plane triangle and let ( x : y : z ) be the trilinear coordinates of an arbitrary point in the plane of triangle ABC.\nA straight line in the plane of triangle ABC whose equation in trilinear coordinates has the form\n\nf ( a, b, c ) x + g ( a, b, c ) y + h ( a, b, c ) z = 0\nwhere the point with trilinear coordinates ( f ( a, b, c ) : g ( a, b, c ) : h ( a, b, c ) ) is a triangle center, \nis a central line in the plane of triangle ABC relative to the triangle ABC.\n\n\n==== Geometrical construction of central line ====\n\nLet X be any triangle center of the triangle ABC. \n\nDraw the lines AX, BX and CX and their reflections in the internal bisectors of the angles at the vertices A, B, C respectively.\nThe reflected lines are concurrent and the point of concurrence is the isogonal conjugate Y of X.\nLet the cevians AY, BY, CY meet the opposite sidelines of triangle ABC at A' , B' , C'  respectively. The triangle A'B'C' is the cevian triangle of Y.\nThe triangle ABC and the cevian triangle A'B'C' are in perspective and let DEF be the axis of perspectivity of the two triangles. The line DEF is the trilinear polar of the point Y.  The line DEF is the central line associated with the triangle center X.\n\n\n=== Triangle conics ===\nA triangle conic is a conic in the plane of the reference triangle and associated with it in some way. For example, the circumcircle and the incircle of the reference triangle are triangle conics. Other examples are the Steiner ellipse which is an ellipse passing through the vertices and having its centre at the centroid of the reference triangle, the Kiepert hyperbola which is a conic passing through the vertices, the centroid and the orthocentre of the reference triangle and the Artzt parabolas which are parabolas touching two sidelines of the reference triangle at vertices of the triangle. Some recently studied triangle conics include Hofstadter ellipses and yff conics. However, there is no formal definition of  the terminology of triangle conic in the literature; that is, the relations  a conic should have with the reference triangle so as to qualify it to be called a triangle conic have not been precisely formulated. WolframMathWorld has a page titled \"Triangle conics\" which gives a list of 42 items (not all of them are conics) without giving a definition of triangle conic.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n=== Triangle cubics ===\nCubic curves arise naturally in the study of triangles. For example, the locus of a point P in the plane of the reference triangle ABC such that, if the reflections of P in the sidelines of triangle ABC are Pa, Pb, Pc, then the lines APa, BPb and CPc are concurrent is a cubic curve named Neuberg cubic. It is the first cubic listed in Bernard Gibert's Catalogue of Triangle Cubics. This Catalogue lists more than 1200 triangle cubics with information on each curve such as the barycentric equation of the curve, triangle centers which lie on the curve, locus properties of the curve and references to literature on the curve.\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== Computers in triangle geometry ==\nThe entry of computers had a deciding influence on the course of development in the interest in triangle geometry witnessed during the closing years of the twentieth century and the early years of the current century. Some of the ways in which the computers had influenced this course have been delineated by Philip Davis. Computers have been used to generate new results in triangle geometry. A survey article published in 2015 gives an account of some of the important new results discovered by the computer programme \"Discoverer\". The following sample of theorems gives a flavor of the new results discovered by Discoverer.\n\nTheorem 6.1  Let P and Q are points, neither lying on a sideline of triangle ABC. If P and Q are isogonal conjugates with respect to ABC, then the Ceva product of their complements lies on the Kiepert hyperbola.\nTheorem 9.1. The Yff center of congruence is the internal center of similitude of the incircle and the circumcircle with respect to the pedal triangle of the incenter.\nThe Lester circle is the circle which passes through the circumcenter, the nine-point center and the outer and inner Fermat points. A generalised Lester circle is a circle which passes through at least four triangle centers. Discoverer has discovered several generalized Lester circles.\nSava Grozdev, Hiroshi Okumura, Deko Dekov  are maintaining a web portal dedicated to computer discovered encyclopedia of Euclidean geometry.\n\n\n== References ==\n\n\n== Additional reading ==\nJohn Mackay (1896). \"Symmedians of a Triangle and their Concomitant Circles\" (PDF). Proceedings of the Edinburgh Math. Soc. XIV: 37–103. Retrieved 7 January 2022.\nWilliam Gallatly (1910). The Modern Geometry of the Triangle. London: Francis Hodgson. Retrieved 4 January 2022.\nRoss Honsberger (1995). Episodes in Nineteenth and Twentienth Century Euclidean Geometry. Mathematical Association of America.\nRoger A Johnson (31 August 2007). Advanced Euclidean Geometry. Dover Publications Inc. ISBN 978-0486462370.\nH S M Coexter (5 September 1996). Geometry Revisited. Mathematical Association of America. ISBN 0883856190.\nAltshiller-Court, Nathan (1952). College geometry; an introduction to the modern geometry of the triangle and the circle. New York: Barnes & Noble. Retrieved 10 January 2022.\nKimberling, C (1998). \"Triangle Centers and Central Triangles\". Congr. Numer.: 1–295.\nPaul Yiu (December 2012). Introduction to the Geometry of the Triangle (PDF). Department of Mathematics Florida Atlantic University. Retrieved 5 January 2022.\nScott, Charlotte Angas (1894). An introductory account of certain modern ideas and methods in plane analytical geometry. London: Macmillan and Co. Retrieved 10 January 2022.",
    "url": "https://en.wikipedia.org/wiki/Modern_triangle_geometry",
    "related_articles": [
      "Altitude (triangle)",
      "Transformation geometry",
      "Hyperbolic geometry",
      "Triangle inequality"
    ]
  },
  "timestamp": 1751689241.4003973
}