{
  "subject": "science",
  "topic": "physics",
  "wikipedia": {
    "title": "Engineering physics",
    "summary": "Engineering physics (EP), sometimes engineering science, is the field of study combining pure science disciplines (such as physics, mathematics, chemistry or biology) and engineering disciplines (computer, nuclear, electrical, aerospace, medical, materials, mechanical, etc.).\nIn many languages, the term technical physics is also used.\nIt has been used since 1861 by the German physics teacher J. Frick in his publications.\n\n",
    "content": "Engineering physics (EP), sometimes engineering science, is the field of study combining pure science disciplines (such as physics, mathematics, chemistry or biology) and engineering disciplines (computer, nuclear, electrical, aerospace, medical, materials, mechanical, etc.).\nIn many languages, the term technical physics is also used.\nIt has been used since 1861 by the German physics teacher J. Frick in his publications.\n\n\n== Terminology ==\nIn some countries, both what would be translated as \"engineering physics\" and what would be translated as \"technical physics\" are disciplines leading to academic degrees. In China, for example, with the former specializing in nuclear power research (i.e. nuclear engineering), and the latter closer to engineering physics. \nIn some universities and their institutions, an engineering physics (or applied physics) major is a discipline or specialization within the scope of engineering science, or applied science.\nSeveral related names have existed since the inception of the interdisciplinary field. For example, some university courses are called or contain the phrase \"physical technologies\" or \"physical engineering sciences\" or \"physical technics\". In some cases, a program formerly called \"physical engineering\" has been renamed \"applied physics\" or has evolved into specialized fields such as \"photonics engineering\".\n\n\n== Expertise ==\nUnlike traditional engineering disciplines, engineering science or engineering physics is not necessarily confined to a particular branch of science, engineering or physics. Instead, engineering science or engineering physics is meant to provide a more thorough grounding in applied physics for a selected specialty such as optics, quantum physics, materials science, applied mechanics, electronics, nanotechnology, microfabrication, microelectronics, computing, photonics, mechanical engineering, electrical engineering, nuclear engineering, biophysics, control theory, aerodynamics, energy, solid-state physics, etc. It is the discipline devoted to creating and optimizing engineering solutions through enhanced understanding and integrated application of mathematical, scientific, statistical, and engineering principles. The discipline is also meant for cross-functionality and bridges the gap between theoretical science and practical engineering with emphasis in research and development, design, and analysis.\n\n\n== Degrees ==\nIn many universities, engineering science programs may be offered at the levels of B.Tech., B.Sc., M.Sc. and Ph.D. Usually, a core of basic and advanced courses in mathematics, physics, chemistry, and biology forms the foundation of the curriculum, while typical elective areas may include fluid dynamics, quantum physics, economics, plasma physics, relativity, solid mechanics, operations research, quantitative finance, information technology and engineering, dynamical systems, bioengineering, environmental engineering, computational engineering, engineering mathematics and statistics, solid-state devices, materials science, electromagnetism, nanoscience, nanotechnology, energy, and optics.\n\n\n== Awards ==\nThere are awards for excellence in engineering physics. For example, Princeton University's Jeffrey O. Kephart '80 Prize is awarded annually to the graduating senior with the best record. Since 2002, the German Physical Society has awarded the Georg-Simon-Ohm-Preis for outstanding research in this field.\n\n\n== See also ==\nApplied physics\nEngineering\nEngineering science and mechanics\nEnvironmental engineering science\nIndex of engineering science and mechanics articles\nIndustrial engineering\n\n\n== Notes and references ==\n\n\n== External links ==\n\"Engineering Physics at Xavier\"\n\"The Engineering Physicist Profession\"\n\"Engineering Physicist Professional Profile\"\nSociety of Engineering Science Inc. Archived 2017-08-07 at the Wayback Machine",
    "url": "https://en.wikipedia.org/wiki/Engineering_physics",
    "related_articles": [
      "Physics",
      "Inspec",
      "Outline of physics",
      "Branches of science"
    ]
  },
  "timestamp": 1751689933.7880404
}